{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "import time\n",
    "import glob\n",
    "import os\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'matplotlib'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mModuleNotFoundError\u001b[0m                       Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-1-cc5cacae57ac>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0;32mimport\u001b[0m \u001b[0mmatplotlib\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mmatplotlib\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpyplot\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mplt\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mModuleNotFoundError\u001b[0m: No module named 'matplotlib'"
     ]
    }
   ],
   "source": [
    "import matplotlib \n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "fname='/media/lnr-ai/christo/github_repos/graphing/data/Copy of s2p_Transaction_data_july.xlsx'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df=pd.read_csv('/var/lib/neo4j/import/CLM_GB_CUSTOMERS_BASE_REPORT.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [],
   "source": [
    "clientswipes_202003_df=pd.read_csv('/var/lib/neo4j/import/clientswipes_202003.csv', nrows=50000)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_id</th>\n",
       "      <th>Dedupegroup</th>\n",
       "      <th>Seg_L3_Num</th>\n",
       "      <th>Seg_L3_STR</th>\n",
       "      <th>TransactionAmount</th>\n",
       "      <th>TransactionDate</th>\n",
       "      <th>companyindex</th>\n",
       "      <th>companyname</th>\n",
       "      <th>franchisename</th>\n",
       "      <th>period</th>\n",
       "      <th>...</th>\n",
       "      <th>db</th>\n",
       "      <th>dbprefix</th>\n",
       "      <th>discretionary</th>\n",
       "      <th>division_id</th>\n",
       "      <th>group_id</th>\n",
       "      <th>month</th>\n",
       "      <th>subclass_id</th>\n",
       "      <th>universaldate</th>\n",
       "      <th>Account_No</th>\n",
       "      <th>ProductType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ObjectId(5e93f2fa29010000bebe795c)</td>\n",
       "      <td>1.463155e+11</td>\n",
       "      <td>1</td>\n",
       "      <td>BOE</td>\n",
       "      <td>-329.14</td>\n",
       "      <td>2020-03-01T00:00:00.000Z</td>\n",
       "      <td>6.0</td>\n",
       "      <td>PNP</td>\n",
       "      <td>PnP Crp Mall of Sout  OUT</td>\n",
       "      <td>202003</td>\n",
       "      <td>...</td>\n",
       "      <td>CMProd202003</td>\n",
       "      <td>CMProd</td>\n",
       "      <td>0</td>\n",
       "      <td>47</td>\n",
       "      <td>471</td>\n",
       "      <td>3</td>\n",
       "      <td>47110</td>\n",
       "      <td>1</td>\n",
       "      <td>3.768000e+15</td>\n",
       "      <td>NEDBANK PRIVATE WEALTH AMEX PLATINUM CHARGE   ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ObjectId(5e93f2fa29010000bebe795d)</td>\n",
       "      <td>1.911182e+11</td>\n",
       "      <td>1</td>\n",
       "      <td>BOE</td>\n",
       "      <td>-67.57</td>\n",
       "      <td>2020-03-01T00:00:00.000Z</td>\n",
       "      <td>6.0</td>\n",
       "      <td>PNP</td>\n",
       "      <td>PNP CRP KILLARNEY</td>\n",
       "      <td>202003</td>\n",
       "      <td>...</td>\n",
       "      <td>CMProd202003</td>\n",
       "      <td>CMProd</td>\n",
       "      <td>0</td>\n",
       "      <td>47</td>\n",
       "      <td>471</td>\n",
       "      <td>3</td>\n",
       "      <td>47110</td>\n",
       "      <td>1</td>\n",
       "      <td>5.898461e+15</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ObjectId(5e93f2fa29010000bebe795e)</td>\n",
       "      <td>1.911182e+11</td>\n",
       "      <td>1</td>\n",
       "      <td>BOE</td>\n",
       "      <td>-109.00</td>\n",
       "      <td>2020-03-01T00:00:00.000Z</td>\n",
       "      <td>177.0</td>\n",
       "      <td>PLAYSTATIONNET</td>\n",
       "      <td>PLAYSTATIONNETWORK</td>\n",
       "      <td>202003</td>\n",
       "      <td>...</td>\n",
       "      <td>CMProd202003</td>\n",
       "      <td>CMProd</td>\n",
       "      <td>2</td>\n",
       "      <td>47</td>\n",
       "      <td>478</td>\n",
       "      <td>3</td>\n",
       "      <td>47810</td>\n",
       "      <td>1</td>\n",
       "      <td>5.898461e+15</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ObjectId(5e93f2fa29010000bebe795f)</td>\n",
       "      <td>1.911182e+11</td>\n",
       "      <td>1</td>\n",
       "      <td>BOE</td>\n",
       "      <td>-68.61</td>\n",
       "      <td>2020-03-01T00:00:00.000Z</td>\n",
       "      <td>11.0</td>\n",
       "      <td>WOOLWORTHS</td>\n",
       "      <td>WOOLWORTHS KILLARNEY MA</td>\n",
       "      <td>202003</td>\n",
       "      <td>...</td>\n",
       "      <td>CMProd202003</td>\n",
       "      <td>CMProd</td>\n",
       "      <td>1</td>\n",
       "      <td>47</td>\n",
       "      <td>471</td>\n",
       "      <td>3</td>\n",
       "      <td>47110</td>\n",
       "      <td>1</td>\n",
       "      <td>5.898461e+15</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ObjectId(5e93f2fa29010000bebe7960)</td>\n",
       "      <td>1.100722e+11</td>\n",
       "      <td>1</td>\n",
       "      <td>BOE</td>\n",
       "      <td>-597.00</td>\n",
       "      <td>2020-03-01T00:00:00.000Z</td>\n",
       "      <td>102.0</td>\n",
       "      <td>AFRIHOST</td>\n",
       "      <td>I AFRIHOST.COM</td>\n",
       "      <td>202003</td>\n",
       "      <td>...</td>\n",
       "      <td>CMProd202003</td>\n",
       "      <td>CMProd</td>\n",
       "      <td>2</td>\n",
       "      <td>63</td>\n",
       "      <td>631</td>\n",
       "      <td>3</td>\n",
       "      <td>63110</td>\n",
       "      <td>1</td>\n",
       "      <td>5.898461e+15</td>\n",
       "      <td>NEDBANK PRIVATE WEALTH VISA CREDIT            ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  _id   Dedupegroup  Seg_L3_Num Seg_L3_STR  \\\n",
       "0  ObjectId(5e93f2fa29010000bebe795c)  1.463155e+11           1        BOE   \n",
       "1  ObjectId(5e93f2fa29010000bebe795d)  1.911182e+11           1        BOE   \n",
       "2  ObjectId(5e93f2fa29010000bebe795e)  1.911182e+11           1        BOE   \n",
       "3  ObjectId(5e93f2fa29010000bebe795f)  1.911182e+11           1        BOE   \n",
       "4  ObjectId(5e93f2fa29010000bebe7960)  1.100722e+11           1        BOE   \n",
       "\n",
       "   TransactionAmount           TransactionDate  companyindex     companyname  \\\n",
       "0            -329.14  2020-03-01T00:00:00.000Z           6.0             PNP   \n",
       "1             -67.57  2020-03-01T00:00:00.000Z           6.0             PNP   \n",
       "2            -109.00  2020-03-01T00:00:00.000Z         177.0  PLAYSTATIONNET   \n",
       "3             -68.61  2020-03-01T00:00:00.000Z          11.0      WOOLWORTHS   \n",
       "4            -597.00  2020-03-01T00:00:00.000Z         102.0        AFRIHOST   \n",
       "\n",
       "               franchisename  period  ...            db dbprefix  \\\n",
       "0  PnP Crp Mall of Sout  OUT  202003  ...  CMProd202003   CMProd   \n",
       "1          PNP CRP KILLARNEY  202003  ...  CMProd202003   CMProd   \n",
       "2         PLAYSTATIONNETWORK  202003  ...  CMProd202003   CMProd   \n",
       "3    WOOLWORTHS KILLARNEY MA  202003  ...  CMProd202003   CMProd   \n",
       "4             I AFRIHOST.COM  202003  ...  CMProd202003   CMProd   \n",
       "\n",
       "  discretionary division_id group_id month subclass_id universaldate  \\\n",
       "0             0          47      471     3       47110             1   \n",
       "1             0          47      471     3       47110             1   \n",
       "2             2          47      478     3       47810             1   \n",
       "3             1          47      471     3       47110             1   \n",
       "4             2          63      631     3       63110             1   \n",
       "\n",
       "     Account_No                                        ProductType  \n",
       "0  3.768000e+15  NEDBANK PRIVATE WEALTH AMEX PLATINUM CHARGE   ...  \n",
       "1  5.898461e+15                                                NaN  \n",
       "2  5.898461e+15                                                NaN  \n",
       "3  5.898461e+15                                                NaN  \n",
       "4  5.898461e+15  NEDBANK PRIVATE WEALTH VISA CREDIT            ...  \n",
       "\n",
       "[5 rows x 23 columns]"
      ]
     },
     "execution_count": 110,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "clientswipes_202003_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "110000015709.0"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0].MASTER_CIS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "146315469982.0"
      ]
     },
     "execution_count": 114,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "clientswipes_202003_df.iloc[0].Dedupegroup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['_id',\n",
       " 'Dedupegroup',\n",
       " 'Seg_L3_Num',\n",
       " 'Seg_L3_STR',\n",
       " 'TransactionAmount',\n",
       " 'TransactionDate',\n",
       " 'companyindex',\n",
       " 'companyname',\n",
       " 'franchisename',\n",
       " 'period',\n",
       " 'channel',\n",
       " 'class_id',\n",
       " 'dayname',\n",
       " 'db',\n",
       " 'dbprefix',\n",
       " 'discretionary',\n",
       " 'division_id',\n",
       " 'group_id',\n",
       " 'month',\n",
       " 'subclass_id',\n",
       " 'universaldate',\n",
       " 'Account_No',\n",
       " 'ProductType']"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(clientswipes_202003_df)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [],
   "source": [
    "df=clientswipes_202003_df[clientswipes_202003_df.Seg_L3_STR.isin([\n",
    " 'CB - PBCVM - Mass Market - Foundation',\n",
    " 'CB - PBCVM - Mass Market - Traditional',\n",
    " 'CB - PBCVM - Middle Market - Primers',\n",
    " 'CB - PBCVM - Middle Market - Young Adults',\n",
    " 'CB - PBCVM - Middle Market - Adults',\n",
    " 'CB - PBCVM - Mass Market - Emerging',\n",
    " 'CB - PBCVM - Middle Market - Matured'])].copy()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [],
   "source": [
    "gf=df.head(100).copy()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [],
   "source": [
    "gf.to_csv(path_or_buf='/media/lnr-ai/christo/github_repos/graphing/data/CLM_GB_CUSTOMERS_BASE_REPORT_sandbox.csv',index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "211648211134.0"
      ]
     },
     "execution_count": 105,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gf.iloc[0].Dedupegroup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['RUNDATE',\n",
       " 'MASTER_CIS',\n",
       " 'CLM_ENROL_DATE',\n",
       " 'ENROLMENT_CHANNEL',\n",
       " 'STATUS',\n",
       " 'IREWARDS_NO',\n",
       " 'CLM_REWARDS_NUMBER',\n",
       " 'AFFINITY',\n",
       " 'GB_APP_DOWNLOAD',\n",
       " 'MONEY_APP_DOWNLOAD',\n",
       " 'CARD_SWIPER_ELIGIBLE',\n",
       " 'CARD_SWIPER_OPTED',\n",
       " 'CARD_SWIPER_OPTED_DATE',\n",
       " 'MONEY_MANAGER_ELIGIBLE',\n",
       " 'MONEY_MNAGER_OPTED',\n",
       " 'MONEY_MNAGER_OPTED_DATE',\n",
       " 'RESPONSIBLE_BORROWER_ELIGIBLE',\n",
       " 'RESPONSIBLE_BORROWER_OPTED',\n",
       " 'RESPONSIBLE_BORROWER_OPTED_DATE',\n",
       " 'GREENBACKS',\n",
       " 'PROBABILISTIC',\n",
       " 'CAMPAIGN_POINTS',\n",
       " 'GREENBACKS_RANDVALUE',\n",
       " 'PROBABILISTIC_RANDVALUE',\n",
       " 'GREENBACKS_RANDRANGE',\n",
       " 'PROBABILISTIC_RANDRANGE']"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(CLM_GB_CUSTOMERS_BASE_REPORT_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]['MASTER_CIS']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'dedupestatic' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-8-05ad1794cdcf>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0mx\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0mdedupestatic_formatted\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m'{:.11e}'\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdedupestatic\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'dedupestatic' is not defined"
     ]
    }
   ],
   "source": [
    "x\n",
    "dedupestatic_formatted='{:.11e}'.format(dedupestatic)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "count=0\n",
    "for dedupestatic in list(CLM_GB_CUSTOMERS_BASE_REPORT_df.MASTER_CIS):\n",
    "    count+=1\n",
    "    dedupestatic_formatted='{:.11e}'.format(dedupestatic)\n",
    "    dedupestatic_formatted=np.format_float_scientific(dedupestatic, unique=False, precision=11, trim='.')\n",
    "    print('{:.11e}'.format(dedupestatic),'; ',np.format_float_scientific(dedupestatic, unique=False, precision=11, trim='.'))\n",
    "    neo4j_query=\"\"\"MATCH (n:Client) WHERE n.dedupestatic='{dedupestatic}' RETURN n LIMIT 25\"\"\".format(dedupestatic=dedupestatic_formatted)\n",
    "    client_link_community_7916_df=graph.run(neo4j_query).to_data_frame()\n",
    "    print(client_link_community_7916_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "count=0\n",
    "for dedupestatic in list(CLM_GB_CUSTOMERS_BASE_REPORT_df.MASTER_CIS):\n",
    "    count+=1\n",
    "    dedupestatic_formatted=np.format_float_scientific(dedupestatic, unique=False, precision=11, trim='.')\n",
    "    neo4j_query=\"\"\"MATCH (n:Client) WHERE n.dedupestatic='{dedupestatic}' RETURN n LIMIT 1\"\"\".format(dedupestatic='{:.11e}'.format(dedupestatic))\n",
    "    client_link_community_7916_df=graph.run(neo4j_query).to_data_frame()\n",
    "    if not client_link_community_7916_df.empty:\n",
    "        print(count)\n",
    "        neo4j_query=\"\"\"MATCH (client:Client) WHERE client.dedupestatic='{dedupestatic}' \n",
    "        SET\n",
    "        client:GreenBacks\n",
    "        RETURN client LIMIT 25\"\"\".format(dedupestatic='{:.11e}'.format(dedupestatic))\n",
    "        graph.run(neo4j_query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "client_link_community_7916_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]['MASTER_CIS']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# dedupestatic='1.91462784202e+11'\n",
    "dedupestatic_formatted='{:.11e}'.format(x)\n",
    "dedupestatic_formatted=np.format_float_scientific(x, unique=False, precision=11, trim='.')\n",
    "neo4j_query=\"\"\"MATCH (n:Client) WHERE n.dedupestatic='{dedupestatic}' RETURN n LIMIT 25\"\"\".format(dedupestatic=dedupestatic)\n",
    "client_link_community_7916_df=graph.run(neo4j_query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "client_link_community_7916_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "dedupestatic=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]['MASTER_CIS']\n",
    "dedupestatic_formatted=np.format_float_scientific(dedupestatic, unique=False, precision=11, trim='.')\n",
    "CLM_ENROL_DATE=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]['CLM_ENROL_DATE']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_query=\"\"\"MATCH (n:Client) WHERE n.dedupestatic='{dedupestatic}' SET n.CLM_ENROL_DATE = date('{CLM_ENROL_DATE}') RETURN n LIMIT 25\"\"\".format(dedupestatic=dedupestatic_formatted,CLM_ENROL_DATE=CLM_ENROL_DATE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(neo4j_query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.dtypes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "list(CLM_GB_CUSTOMERS_BASE_REPORT_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.fillna('not applicable',inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "SyntaxError: Variable `nan` not defined (line 7, column 19 (offset: 234))\n\"client.AFFINITY = nan,\"\n                   ^",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-9-7dff3608a670>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     79\u001b[0m                                )\n\u001b[1;32m     80\u001b[0m \u001b[0mneo4j_query\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 81\u001b[0;31m \u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mneo4j_query\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    524\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0;32mreturn\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    525\u001b[0m         \"\"\"\n\u001b[0;32m--> 526\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mautocommit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    527\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    528\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mseparate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    803\u001b[0m                                              \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    804\u001b[0m                                              \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 805\u001b[0;31m                                              entities=entities))\n\u001b[0m\u001b[1;32m    806\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mCypherError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    807\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0;34m\"code\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"message\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, statement, parameters, tx, graph, keys, entities)\u001b[0m\n\u001b[1;32m    283\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    284\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtx\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 285\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_1\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    286\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    287\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_in_tx\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_run_1\u001b[0;34m(self, statement, parameters, graph, keys, entities)\u001b[0m\n\u001b[1;32m    246\u001b[0m                     on_success=result.update_metadata, on_failure=self._fail, on_summary=result.done)\n\u001b[1;32m    247\u001b[0m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 248\u001b[0;31m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    249\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    250\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    417\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    418\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 419\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    420\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    459\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0msummary_signature\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34mb\"\\x7F\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    460\u001b[0m             \u001b[0mlog_debug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 461\u001b[0;31m             \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    462\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    463\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mProtocolError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Unexpected response message with signature %02X\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    749\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_failure\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    750\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 751\u001b[0;31m             \u001b[0mhandler\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    752\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_summary\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    753\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_fail\u001b[0;34m(cls, metadata)\u001b[0m\n\u001b[1;32m    279\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_fail\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    280\u001b[0m         \u001b[0;32mfrom\u001b[0m \u001b[0mpy2neo\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 281\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    282\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    283\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mClientError\u001b[0m: SyntaxError: Variable `nan` not defined (line 7, column 19 (offset: 234))\n\"client.AFFINITY = nan,\"\n                   ^"
     ]
    }
   ],
   "source": [
    "row=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]\n",
    "dedupestatic=np.format_float_scientific(row['MASTER_CIS'], unique=False, precision=11, trim='.')\n",
    "CLM_ENROL_DATE=row['CLM_ENROL_DATE']\n",
    "ENROLMENT_CHANNEL=row['ENROLMENT_CHANNEL']\n",
    "STATUS=row['STATUS']\n",
    "CLM_REWARDS_NUMBER=row['CLM_REWARDS_NUMBER']\n",
    "AFFINITY=row['AFFINITY']\n",
    "GB_APP_DOWNLOAD=row['GB_APP_DOWNLOAD']\n",
    "MONEY_APP_DOWNLOAD=row['MONEY_APP_DOWNLOAD']\n",
    "CARD_SWIPER_ELIGIBLE=row['CARD_SWIPER_ELIGIBLE']\n",
    "CARD_SWIPER_OPTED=row['CARD_SWIPER_OPTED']\n",
    "CARD_SWIPER_OPTED_DATE=row['CARD_SWIPER_OPTED_DATE']\n",
    "# -----------------------------------------------------    \n",
    "MONEY_MANAGER_ELIGIBLE=row['MONEY_MANAGER_ELIGIBLE']\n",
    "MONEY_MANAGER_OPTED=row['MONEY_MNAGER_OPTED']\n",
    "MONEY_MANAGER_OPTED_DATE=row['MONEY_MNAGER_OPTED_DATE']\n",
    "RESPONSIBLE_BORROWER_ELIGIBLE=row['RESPONSIBLE_BORROWER_ELIGIBLE']\n",
    "RESPONSIBLE_BORROWER_OPTED=row['RESPONSIBLE_BORROWER_OPTED']\n",
    "RESPONSIBLE_BORROWER_OPTED_DATE=row['RESPONSIBLE_BORROWER_OPTED_DATE']\n",
    "GREENBACKS=row['GREENBACKS']\n",
    "PROBABILISTIC=row['PROBABILISTIC']\n",
    "CAMPAIGN_POINTS=row['CAMPAIGN_POINTS']\n",
    "GREENBACKS_RANDVALUE=row['GREENBACKS_RANDVALUE']\n",
    "# -----------------------------------------------------    \n",
    "PROBABILISTIC_RANDVALUE=row['PROBABILISTIC_RANDVALUE']\n",
    "GREENBACKS_RANDRANGE=row['GREENBACKS_RANDRANGE']\n",
    "PROBABILISTIC_RANDRANGE=row['PROBABILISTIC_RANDRANGE']\n",
    "neo4j_query=\"\"\"MATCH (client:GreenBacks) WHERE client.dedupestatic='{dedupestatic}' \n",
    "SET\n",
    "client.CLM_ENROL_DATE = date('{CLM_ENROL_DATE}'),\n",
    "client.ENROLMENT_CHANNEL = '{ENROLMENT_CHANNEL}',\n",
    "client.STATUS = '{STATUS}',\n",
    "client.CLM_REWARDS_NUMBER = {CLM_REWARDS_NUMBER},\n",
    "client.AFFINITY = {AFFINITY},\n",
    "client.GB_APP_DOWNLOAD = {GB_APP_DOWNLOAD},\n",
    "client.MONEY_APP_DOWNLOAD = {MONEY_APP_DOWNLOAD},\n",
    "client.CARD_SWIPER_ELIGIBLE = {CARD_SWIPER_ELIGIBLE},\n",
    "client.CARD_SWIPER_OPTED = {CARD_SWIPER_OPTED}, \n",
    "\n",
    "client.MONEY_MANAGER_OPTED_DATE = date('{MONEY_MANAGER_OPTED_DATE}'),\n",
    "client.RESPONSIBLE_BORROWER_ELIGIBLE = {RESPONSIBLE_BORROWER_ELIGIBLE},\n",
    "client.RESPONSIBLE_BORROWER_OPTED = {RESPONSIBLE_BORROWER_OPTED},\n",
    "client.RESPONSIBLE_BORROWER_OPTED_DATE = date('{RESPONSIBLE_BORROWER_OPTED_DATE}'),\n",
    "client.GREENBACKS = {GREENBACKS},\n",
    "client.PROBABILISTIC = {PROBABILISTIC},\n",
    "client.CAMPAIGN_POINTS = {CAMPAIGN_POINTS},\n",
    "client.GREENBACKS_RANDVALUE = {GREENBACKS_RANDVALUE},\n",
    "\n",
    "client.PROBABILISTIC_RANDVALUE = {PROBABILISTIC_RANDVALUE},\n",
    "client.GREENBACKS_RANDRANGE = '{GREENBACKS_RANDRANGE}',\n",
    "client.PROBABILISTIC_RANDRANGE = '{PROBABILISTIC_RANDRANGE}'    \n",
    "RETURN client LIMIT 1\"\"\".format(dedupestatic=dedupestatic,\n",
    "                               CLM_ENROL_DATE=CLM_ENROL_DATE,\n",
    "                                ENROLMENT_CHANNEL=ENROLMENT_CHANNEL,\n",
    "                                STATUS=STATUS,\n",
    "                                CLM_REWARDS_NUMBER=CLM_REWARDS_NUMBER,\n",
    "                                AFFINITY=AFFINITY,\n",
    "                                GB_APP_DOWNLOAD=GB_APP_DOWNLOAD,\n",
    "                                MONEY_APP_DOWNLOAD=MONEY_APP_DOWNLOAD,\n",
    "                                CARD_SWIPER_ELIGIBLE=CARD_SWIPER_ELIGIBLE,\n",
    "                                CARD_SWIPER_OPTED=CARD_SWIPER_OPTED,\n",
    "                                CARD_SWIPER_OPTED_DATE=CARD_SWIPER_OPTED_DATE,\n",
    "                            # -----------------------------------------------------    \n",
    "                                MONEY_MANAGER_ELIGIBLE=MONEY_MANAGER_ELIGIBLE,\n",
    "                                MONEY_MANAGER_OPTED=MONEY_MANAGER_OPTED,\n",
    "                                MONEY_MANAGER_OPTED_DATE=MONEY_MANAGER_OPTED_DATE,\n",
    "                                RESPONSIBLE_BORROWER_ELIGIBLE=RESPONSIBLE_BORROWER_ELIGIBLE,\n",
    "                                RESPONSIBLE_BORROWER_OPTED=RESPONSIBLE_BORROWER_OPTED,\n",
    "                                RESPONSIBLE_BORROWER_OPTED_DATE=RESPONSIBLE_BORROWER_OPTED_DATE,\n",
    "                                GREENBACKS=GREENBACKS,\n",
    "                                PROBABILISTIC=PROBABILISTIC,\n",
    "                                CAMPAIGN_POINTS=CAMPAIGN_POINTS,\n",
    "                                GREENBACKS_RANDVALUE=GREENBACKS_RANDVALUE,\n",
    "                            # -----------------------------------------------------    \n",
    "                                PROBABILISTIC_RANDVALUE=PROBABILISTIC_RANDVALUE,\n",
    "                                GREENBACKS_RANDRANGE=GREENBACKS_RANDRANGE,\n",
    "                                PROBABILISTIC_RANDRANGE=PROBABILISTIC_RANDRANGE\n",
    "\n",
    "                               )\n",
    "neo4j_query\n",
    "graph.run(neo4j_query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RUNDATE                                20200914\n",
       "MASTER_CIS                              1.1e+11\n",
       "CLM_ENROL_DATE                       2019-09-13\n",
       "ENROLMENT_CHANNEL                             B\n",
       "STATUS                                        A\n",
       "IREWARDS_NO                          9.5071e+11\n",
       "CLM_REWARDS_NUMBER                 460000091765\n",
       "AFFINITY                                    NaN\n",
       "GB_APP_DOWNLOAD                               0\n",
       "MONEY_APP_DOWNLOAD                            1\n",
       "CARD_SWIPER_ELIGIBLE                          1\n",
       "CARD_SWIPER_OPTED                             1\n",
       "CARD_SWIPER_OPTED_DATE               2019-09-13\n",
       "MONEY_MANAGER_ELIGIBLE                        1\n",
       "MONEY_MNAGER_OPTED                            0\n",
       "MONEY_MNAGER_OPTED_DATE                     NaN\n",
       "RESPONSIBLE_BORROWER_ELIGIBLE                 1\n",
       "RESPONSIBLE_BORROWER_OPTED                    0\n",
       "RESPONSIBLE_BORROWER_OPTED_DATE             NaN\n",
       "GREENBACKS                               134730\n",
       "PROBABILISTIC                               180\n",
       "CAMPAIGN_POINTS                             NaN\n",
       "GREENBACKS_RANDVALUE                    3772.44\n",
       "PROBABILISTIC_RANDVALUE                    5.04\n",
       "GREENBACKS_RANDRANGE                    > R1000\n",
       "PROBABILISTIC_RANDRANGE            R0 up to R50\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{-999,\n",
       " '> R1000',\n",
       " 'R0',\n",
       " 'R0 up to R50',\n",
       " 'R101 up to R200',\n",
       " 'R201 up to R500',\n",
       " 'R501 up to R1000',\n",
       " 'R51 up to R100'}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "set(CLM_GB_CUSTOMERS_BASE_REPORT_df['GREENBACKS_RANDRANGE'].fillna(-999))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df['CLM_ENROL_DATE'].fillna('1900-01-01', inplace = True)\n",
    "CLM_GB_CUSTOMERS_BASE_REPORT_df['CARD_SWIPER_OPTED_DATE'].fillna('1900-01-01', inplace = True)\n",
    "CLM_GB_CUSTOMERS_BASE_REPORT_df['MONEY_MNAGER_OPTED_DATE'].fillna('1900-01-01', inplace = True)\n",
    "CLM_GB_CUSTOMERS_BASE_REPORT_df['RESPONSIBLE_BORROWER_OPTED_DATE'].fillna('1900-01-01', inplace = True)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df=CLM_GB_CUSTOMERS_BASE_REPORT_df[~pd.isnull(CLM_GB_CUSTOMERS_BASE_REPORT_df[\"MASTER_CIS\"])].copy()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df['MASTER_CIS']=CLM_GB_CUSTOMERS_BASE_REPORT_df['MASTER_CIS'].astype(str).astype(float).astype(int)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(882284, 26)"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0         110000015709\n",
       "1         110000074209\n",
       "2         110000084808\n",
       "3         110000085006\n",
       "4         110000125008\n",
       "              ...     \n",
       "882280    600000920573\n",
       "882281    600000920929\n",
       "882282    600000921504\n",
       "882283    600000921784\n",
       "882284    600000923420\n",
       "Name: MASTER_CIS, Length: 882284, dtype: int64"
      ]
     },
     "execution_count": 135,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.MASTER_CIS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [],
   "source": [
    "CLM_GB_CUSTOMERS_BASE_REPORT_df.to_csv(path_or_buf='/media/lnr-ai/christo/github_repos/graphing/data/CLM_GB_CUSTOMERS_BASE_REPORT.csv',index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "metadata": {},
   "outputs": [],
   "source": [
    "row=CLM_GB_CUSTOMERS_BASE_REPORT_df.iloc[0]\n",
    "dedupestatic=np.format_float_scientific(row['MASTER_CIS'], unique=False, precision=11, trim='.')\n",
    "def neo4j_query_fn(row):\n",
    "    dedupestatic=row['MASTER_CIS']\n",
    "    CLM_ENROL_DATE=row['CLM_ENROL_DATE']\n",
    "    ENROLMENT_CHANNEL=row['ENROLMENT_CHANNEL']\n",
    "    STATUS=row['STATUS']\n",
    "    IREWARDS_NO=row['IREWARDS_NO']\n",
    "    CLM_REWARDS_NUMBER=row['CLM_REWARDS_NUMBER']\n",
    "    AFFINITY=row['AFFINITY']\n",
    "    GB_APP_DOWNLOAD=row['GB_APP_DOWNLOAD']\n",
    "    MONEY_APP_DOWNLOAD=row['MONEY_APP_DOWNLOAD']\n",
    "    CARD_SWIPER_ELIGIBLE=row['CARD_SWIPER_ELIGIBLE']\n",
    "    CARD_SWIPER_OPTED=row['CARD_SWIPER_OPTED']\n",
    "    CARD_SWIPER_OPTED_DATE=row['CARD_SWIPER_OPTED_DATE']\n",
    "    # -----------------------------------------------------    \n",
    "    MONEY_MANAGER_ELIGIBLE=row['MONEY_MANAGER_ELIGIBLE']\n",
    "    MONEY_MANAGER_OPTED=row['MONEY_MNAGER_OPTED']\n",
    "    MONEY_MANAGER_OPTED_DATE=row['MONEY_MNAGER_OPTED_DATE']\n",
    "    RESPONSIBLE_BORROWER_ELIGIBLE=row['RESPONSIBLE_BORROWER_ELIGIBLE']\n",
    "    RESPONSIBLE_BORROWER_OPTED=row['RESPONSIBLE_BORROWER_OPTED']\n",
    "    RESPONSIBLE_BORROWER_OPTED_DATE=row['RESPONSIBLE_BORROWER_OPTED_DATE']\n",
    "    GREENBACKS=row['GREENBACKS']\n",
    "    PROBABILISTIC=row['PROBABILISTIC']\n",
    "    CAMPAIGN_POINTS=row['CAMPAIGN_POINTS']\n",
    "    GREENBACKS_RANDVALUE=row['GREENBACKS_RANDVALUE']\n",
    "    # -----------------------------------------------------    \n",
    "    PROBABILISTIC_RANDVALUE=row['PROBABILISTIC_RANDVALUE']\n",
    "    GREENBACKS_RANDRANGE=row['GREENBACKS_RANDRANGE']\n",
    "    PROBABILISTIC_RANDRANGE=row['PROBABILISTIC_RANDRANGE']\n",
    "\n",
    "    return \"\"\"MATCH (client:GreenBacks) WHERE client.dedupestatic={dedupestatic}\n",
    "    SET client.CLM_ENROL_DATE = coalesce(date('{CLM_ENROL_DATE}'),\"not applicable\"),\n",
    "    client.ENROLMENT_CHANNEL = coalesce('{ENROLMENT_CHANNEL}',\"not applicable\"),\n",
    "    client.STATUS = coalesce('{STATUS}',\"not applicable\"),\n",
    "    client.IREWARDS_NO = coalesce(toInteger('{IREWARDS_NO}'),\"not applicable\"),\n",
    "    client.CLM_REWARDS_NUMBER = coalesce(toInteger('{CLM_REWARDS_NUMBER}'),\"not applicable\"),\n",
    "    client.AFFINITY = coalesce('{AFFINITY}',\"not applicable\"),\n",
    "\n",
    "    client.GB_APP_DOWNLOAD = coalesce(toInteger('{GB_APP_DOWNLOAD}'),\"not applicable\"),\n",
    "    client.MONEY_APP_DOWNLOAD = coalesce(toInteger('{MONEY_APP_DOWNLOAD}'),\"not applicable\"),\n",
    "\n",
    "    client.CARD_SWIPER_ELIGIBLE = coalesce(toInteger('{CARD_SWIPER_ELIGIBLE}'),\"not applicable\"),\n",
    "    client.CARD_SWIPER_OPTED = coalesce(toInteger('{CARD_SWIPER_OPTED}'),\"not applicable\"),\n",
    "    client.CARD_SWIPER_OPTED_DATE=coalesce(date('{CARD_SWIPER_OPTED_DATE}'),\"not applicable\"),\n",
    "\n",
    "    client.MONEY_MANAGER_ELIGIBLE=coalesce(toInteger('{MONEY_MANAGER_ELIGIBLE}'),\"not applicable\"),\n",
    "    client.MONEY_MANAGER_OPTED=coalesce(toInteger('{MONEY_MANAGER_OPTED}'),\"not applicable\"),\n",
    "    client.MONEY_MANAGER_OPTED_DATE = coalesce(date('{MONEY_MANAGER_OPTED_DATE}'),\"not applicable\"),\n",
    "\n",
    "    client.RESPONSIBLE_BORROWER_ELIGIBLE = coalesce(toInteger('{RESPONSIBLE_BORROWER_ELIGIBLE}'),\"not applicable\"),\n",
    "    client.RESPONSIBLE_BORROWER_OPTED = coalesce(toInteger('{RESPONSIBLE_BORROWER_OPTED}'),\"not applicable\"),\n",
    "    client.RESPONSIBLE_BORROWER_OPTED_DATE = coalesce(date('{RESPONSIBLE_BORROWER_OPTED_DATE}'),\"not applicable\"),\n",
    "\n",
    "    client.GREENBACKS = coalesce(toInteger('{GREENBACKS}'),\"not applicable\"),\n",
    "    client.PROBABILISTIC = coalesce(toInteger('{PROBABILISTIC}'),\"not applicable\"),\n",
    "    client.CAMPAIGN_POINTS = coalesce(toInteger('{CAMPAIGN_POINTS}'),\"not applicable\"),\n",
    "    client.GREENBACKS_RANDVALUE = coalesce(toFloat('{GREENBACKS_RANDVALUE}'),\"not applicable\"),\n",
    "\n",
    "    client.PROBABILISTIC_RANDVALUE = coalesce(toFloat('{PROBABILISTIC_RANDVALUE}'),\"not applicable\"),\n",
    "    client.GREENBACKS_RANDRANGE = coalesce('{GREENBACKS_RANDRANGE}',\"not applicable\"),\n",
    "    client.PROBABILISTIC_RANDRANGE = coalesce('{PROBABILISTIC_RANDRANGE}',\"not applicable\")\n",
    "    RETURN count(client) AS client_count;\n",
    "\n",
    "    \"\"\".format(dedupestatic=dedupestatic,\n",
    "                               CLM_ENROL_DATE=CLM_ENROL_DATE,\n",
    "                                ENROLMENT_CHANNEL=ENROLMENT_CHANNEL,\n",
    "                                STATUS=STATUS,\n",
    "               IREWARDS_NO=IREWARDS_NO,\n",
    "                                CLM_REWARDS_NUMBER=CLM_REWARDS_NUMBER,\n",
    "                                AFFINITY=AFFINITY,\n",
    "                                GB_APP_DOWNLOAD=GB_APP_DOWNLOAD,\n",
    "                                MONEY_APP_DOWNLOAD=MONEY_APP_DOWNLOAD,\n",
    "                                CARD_SWIPER_ELIGIBLE=CARD_SWIPER_ELIGIBLE,\n",
    "                                CARD_SWIPER_OPTED=CARD_SWIPER_OPTED,\n",
    "                                CARD_SWIPER_OPTED_DATE=CARD_SWIPER_OPTED_DATE,\n",
    "                            # -----------------------------------------------------    \n",
    "                                MONEY_MANAGER_ELIGIBLE=MONEY_MANAGER_ELIGIBLE,\n",
    "                                MONEY_MANAGER_OPTED=MONEY_MANAGER_OPTED,\n",
    "                                MONEY_MANAGER_OPTED_DATE=MONEY_MANAGER_OPTED_DATE,\n",
    "                                RESPONSIBLE_BORROWER_ELIGIBLE=RESPONSIBLE_BORROWER_ELIGIBLE,\n",
    "                                RESPONSIBLE_BORROWER_OPTED=RESPONSIBLE_BORROWER_OPTED,\n",
    "                                RESPONSIBLE_BORROWER_OPTED_DATE=RESPONSIBLE_BORROWER_OPTED_DATE,\n",
    "                                GREENBACKS=GREENBACKS,\n",
    "                                PROBABILISTIC=PROBABILISTIC,\n",
    "                                CAMPAIGN_POINTS=CAMPAIGN_POINTS,\n",
    "                                GREENBACKS_RANDVALUE=GREENBACKS_RANDVALUE,\n",
    "                            # -----------------------------------------------------    \n",
    "                                PROBABILISTIC_RANDVALUE=PROBABILISTIC_RANDVALUE,\n",
    "                                GREENBACKS_RANDRANGE=GREENBACKS_RANDRANGE,\n",
    "                                PROBABILISTIC_RANDRANGE=PROBABILISTIC_RANDRANGE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_query=neo4j_query_fn(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'MATCH (client:GreenBacks) WHERE client.dedupestatic=110000015709\\n    SET client.CLM_ENROL_DATE = coalesce(date(\\'2019-09-13\\'),\"not applicable\"),\\n    client.ENROLMENT_CHANNEL = coalesce(\\'B\\',\"not applicable\"),\\n    client.STATUS = coalesce(\\'A\\',\"not applicable\"),\\n    client.IREWARDS_NO = coalesce(toInteger(\\'950710155147.0\\'),\"not applicable\"),\\n    client.CLM_REWARDS_NUMBER = coalesce(toInteger(\\'460000091765\\'),\"not applicable\"),\\n    client.AFFINITY = coalesce(\\'nan\\',\"not applicable\"),\\n\\n    client.GB_APP_DOWNLOAD = coalesce(toInteger(\\'0.0\\'),\"not applicable\"),\\n    client.MONEY_APP_DOWNLOAD = coalesce(toInteger(\\'1.0\\'),\"not applicable\"),\\n\\n    client.CARD_SWIPER_ELIGIBLE = coalesce(toInteger(\\'1.0\\'),\"not applicable\"),\\n    client.CARD_SWIPER_OPTED = coalesce(toInteger(\\'1\\'),\"not applicable\"),\\n    client.CARD_SWIPER_OPTED_DATE=coalesce(date(\\'2019-09-13\\'),\"not applicable\"),\\n\\n    client.MONEY_MANAGER_ELIGIBLE=coalesce(toInteger(\\'1\\'),\"not applicable\"),\\n    client.MONEY_MANAGER_OPTED=coalesce(toInteger(\\'0\\'),\"not applicable\"),\\n    client.MONEY_MANAGER_OPTED_DATE = coalesce(date(\\'1900-01-01\\'),\"not applicable\"),\\n\\n    client.RESPONSIBLE_BORROWER_ELIGIBLE = coalesce(toInteger(\\'1\\'),\"not applicable\"),\\n    client.RESPONSIBLE_BORROWER_OPTED = coalesce(toInteger(\\'0\\'),\"not applicable\"),\\n    client.RESPONSIBLE_BORROWER_OPTED_DATE = coalesce(date(\\'1900-01-01\\'),\"not applicable\"),\\n\\n    client.GREENBACKS = coalesce(toInteger(\\'134730.0\\'),\"not applicable\"),\\n    client.PROBABILISTIC = coalesce(toInteger(\\'180.0\\'),\"not applicable\"),\\n    client.CAMPAIGN_POINTS = coalesce(toInteger(\\'nan\\'),\"not applicable\"),\\n    client.GREENBACKS_RANDVALUE = coalesce(toFloat(\\'3772.44\\'),\"not applicable\"),\\n\\n    client.PROBABILISTIC_RANDVALUE = coalesce(toFloat(\\'5.04\\'),\"not applicable\"),\\n    client.GREENBACKS_RANDRANGE = coalesce(\\'> R1000\\',\"not applicable\"),\\n    client.PROBABILISTIC_RANDRANGE = coalesce(\\'R0 up to R50\\',\"not applicable\")\\n    RETURN count(client) AS client_count;\\n\\n    '"
      ]
     },
     "execution_count": 131,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 ;  [{'client_count': 1}]\n",
      "2 ;  [{'client_count': 0}]\n",
      "3 ;  [{'client_count': 0}]\n",
      "4 ;  [{'client_count': 0}]\n",
      "5 ;  [{'client_count': 1}]\n",
      "6 ;  [{'client_count': 0}]\n",
      "7 ;  [{'client_count': 0}]\n",
      "8 ;  [{'client_count': 0}]\n",
      "9 ;  [{'client_count': 0}]\n",
      "10 ;  [{'client_count': 1}]\n",
      "11 ;  [{'client_count': 1}]\n",
      "12 ;  [{'client_count': 0}]\n",
      "13 ;  [{'client_count': 1}]\n",
      "14 ;  [{'client_count': 1}]\n",
      "15 ;  [{'client_count': 1}]\n",
      "16 ;  [{'client_count': 1}]\n",
      "17 ;  [{'client_count': 0}]\n",
      "18 ;  [{'client_count': 1}]\n",
      "19 ;  [{'client_count': 1}]\n",
      "20 ;  [{'client_count': 0}]\n",
      "21 ;  [{'client_count': 1}]\n",
      "22 ;  [{'client_count': 1}]\n",
      "23 ;  [{'client_count': 1}]\n",
      "24 ;  [{'client_count': 1}]\n",
      "25 ;  [{'client_count': 1}]\n",
      "26 ;  [{'client_count': 0}]\n",
      "27 ;  [{'client_count': 0}]\n",
      "28 ;  [{'client_count': 1}]\n",
      "29 ;  [{'client_count': 1}]\n",
      "30 ;  [{'client_count': 1}]\n",
      "31 ;  [{'client_count': 1}]\n",
      "32 ;  [{'client_count': 0}]\n",
      "33 ;  [{'client_count': 1}]\n",
      "34 ;  [{'client_count': 1}]\n",
      "35 ;  [{'client_count': 1}]\n",
      "36 ;  [{'client_count': 1}]\n",
      "37 ;  [{'client_count': 1}]\n",
      "38 ;  [{'client_count': 1}]\n",
      "39 ;  [{'client_count': 1}]\n",
      "40 ;  [{'client_count': 1}]\n",
      "41 ;  [{'client_count': 0}]\n",
      "42 ;  [{'client_count': 1}]\n",
      "43 ;  [{'client_count': 1}]\n",
      "44 ;  [{'client_count': 1}]\n",
      "45 ;  [{'client_count': 1}]\n",
      "46 ;  [{'client_count': 1}]\n",
      "47 ;  [{'client_count': 1}]\n",
      "48 ;  [{'client_count': 1}]\n",
      "49 ;  [{'client_count': 1}]\n",
      "50 ;  [{'client_count': 1}]\n",
      "51 ;  [{'client_count': 1}]\n",
      "52 ;  [{'client_count': 1}]\n",
      "53 ;  [{'client_count': 1}]\n",
      "54 ;  [{'client_count': 1}]\n",
      "55 ;  [{'client_count': 1}]\n",
      "56 ;  [{'client_count': 1}]\n",
      "57 ;  [{'client_count': 1}]\n",
      "58 ;  [{'client_count': 0}]\n",
      "59 ;  [{'client_count': 0}]\n",
      "60 ;  [{'client_count': 0}]\n",
      "61 ;  [{'client_count': 1}]\n",
      "62 ;  [{'client_count': 1}]\n",
      "63 ;  [{'client_count': 1}]\n",
      "64 ;  [{'client_count': 1}]\n",
      "65 ;  [{'client_count': 1}]\n",
      "66 ;  [{'client_count': 0}]\n",
      "67 ;  [{'client_count': 0}]\n",
      "68 ;  [{'client_count': 1}]\n",
      "69 ;  [{'client_count': 1}]\n",
      "70 ;  [{'client_count': 1}]\n",
      "71 ;  [{'client_count': 1}]\n",
      "72 ;  [{'client_count': 1}]\n",
      "73 ;  [{'client_count': 1}]\n",
      "74 ;  [{'client_count': 1}]\n",
      "75 ;  [{'client_count': 1}]\n",
      "76 ;  [{'client_count': 1}]\n",
      "77 ;  [{'client_count': 1}]\n",
      "78 ;  [{'client_count': 1}]\n",
      "79 ;  [{'client_count': 0}]\n",
      "80 ;  [{'client_count': 1}]\n",
      "81 ;  [{'client_count': 1}]\n",
      "82 ;  [{'client_count': 0}]\n",
      "83 ;  [{'client_count': 1}]\n",
      "84 ;  [{'client_count': 1}]\n",
      "85 ;  [{'client_count': 0}]\n",
      "86 ;  [{'client_count': 1}]\n",
      "87 ;  [{'client_count': 1}]\n",
      "88 ;  [{'client_count': 1}]\n",
      "89 ;  [{'client_count': 1}]\n",
      "90 ;  [{'client_count': 1}]\n",
      "91 ;  [{'client_count': 1}]\n",
      "92 ;  [{'client_count': 1}]\n",
      "93 ;  [{'client_count': 1}]\n",
      "94 ;  [{'client_count': 1}]\n",
      "95 ;  [{'client_count': 1}]\n",
      "96 ;  [{'client_count': 0}]\n",
      "97 ;  [{'client_count': 1}]\n",
      "98 ;  [{'client_count': 1}]\n",
      "99 ;  [{'client_count': 1}]\n",
      "100 ;  [{'client_count': 1}]\n",
      "101 ;  [{'client_count': 1}]\n",
      "102 ;  [{'client_count': 1}]\n",
      "103 ;  [{'client_count': 1}]\n",
      "104 ;  [{'client_count': 1}]\n",
      "105 ;  [{'client_count': 0}]\n",
      "106 ;  [{'client_count': 1}]\n",
      "107 ;  [{'client_count': 1}]\n",
      "108 ;  [{'client_count': 1}]\n",
      "109 ;  [{'client_count': 1}]\n",
      "110 ;  [{'client_count': 1}]\n",
      "111 ;  [{'client_count': 0}]\n",
      "112 ;  [{'client_count': 0}]\n",
      "113 ;  [{'client_count': 1}]\n",
      "114 ;  [{'client_count': 1}]\n",
      "115 ;  [{'client_count': 1}]\n",
      "116 ;  [{'client_count': 1}]\n",
      "117 ;  [{'client_count': 1}]\n",
      "118 ;  [{'client_count': 0}]\n",
      "119 ;  [{'client_count': 1}]\n",
      "120 ;  [{'client_count': 1}]\n",
      "121 ;  [{'client_count': 1}]\n",
      "122 ;  [{'client_count': 1}]\n",
      "123 ;  [{'client_count': 0}]\n",
      "124 ;  [{'client_count': 1}]\n",
      "125 ;  [{'client_count': 0}]\n",
      "126 ;  [{'client_count': 1}]\n",
      "127 ;  [{'client_count': 1}]\n",
      "128 ;  [{'client_count': 1}]\n",
      "129 ;  [{'client_count': 0}]\n",
      "130 ;  [{'client_count': 0}]\n",
      "131 ;  [{'client_count': 1}]\n",
      "132 ;  [{'client_count': 1}]\n",
      "133 ;  [{'client_count': 1}]\n",
      "134 ;  [{'client_count': 0}]\n",
      "135 ;  [{'client_count': 0}]\n",
      "136 ;  [{'client_count': 0}]\n",
      "137 ;  [{'client_count': 1}]\n",
      "138 ;  [{'client_count': 0}]\n",
      "139 ;  [{'client_count': 0}]\n",
      "140 ;  [{'client_count': 1}]\n",
      "141 ;  [{'client_count': 1}]\n",
      "142 ;  [{'client_count': 0}]\n",
      "143 ;  [{'client_count': 0}]\n",
      "144 ;  [{'client_count': 0}]\n",
      "145 ;  [{'client_count': 0}]\n",
      "146 ;  [{'client_count': 1}]\n",
      "147 ;  [{'client_count': 1}]\n",
      "148 ;  [{'client_count': 0}]\n",
      "149 ;  [{'client_count': 0}]\n",
      "150 ;  [{'client_count': 0}]\n",
      "151 ;  [{'client_count': 1}]\n",
      "152 ;  [{'client_count': 1}]\n",
      "153 ;  [{'client_count': 1}]\n",
      "154 ;  [{'client_count': 1}]\n",
      "155 ;  [{'client_count': 1}]\n",
      "156 ;  [{'client_count': 1}]\n",
      "157 ;  [{'client_count': 1}]\n",
      "158 ;  [{'client_count': 1}]\n",
      "159 ;  [{'client_count': 1}]\n",
      "160 ;  [{'client_count': 0}]\n",
      "161 ;  [{'client_count': 0}]\n",
      "162 ;  [{'client_count': 1}]\n",
      "163 ;  [{'client_count': 0}]\n",
      "164 ;  [{'client_count': 0}]\n",
      "165 ;  [{'client_count': 1}]\n",
      "166 ;  [{'client_count': 1}]\n",
      "167 ;  [{'client_count': 1}]\n",
      "168 ;  [{'client_count': 1}]\n",
      "169 ;  [{'client_count': 1}]\n",
      "170 ;  [{'client_count': 1}]\n",
      "171 ;  [{'client_count': 0}]\n",
      "172 ;  [{'client_count': 1}]\n",
      "173 ;  [{'client_count': 1}]\n",
      "174 ;  [{'client_count': 1}]\n",
      "175 ;  [{'client_count': 0}]\n",
      "176 ;  [{'client_count': 0}]\n",
      "177 ;  [{'client_count': 0}]\n",
      "178 ;  [{'client_count': 1}]\n",
      "179 ;  [{'client_count': 1}]\n",
      "180 ;  [{'client_count': 1}]\n",
      "181 ;  [{'client_count': 1}]\n",
      "182 ;  [{'client_count': 1}]\n",
      "183 ;  [{'client_count': 0}]\n",
      "184 ;  [{'client_count': 1}]\n",
      "185 ;  [{'client_count': 0}]\n",
      "186 ;  [{'client_count': 0}]\n",
      "187 ;  [{'client_count': 0}]\n",
      "188 ;  [{'client_count': 0}]\n",
      "189 ;  [{'client_count': 1}]\n",
      "190 ;  [{'client_count': 0}]\n",
      "191 ;  [{'client_count': 1}]\n",
      "192 ;  [{'client_count': 1}]\n",
      "193 ;  [{'client_count': 1}]\n",
      "194 ;  [{'client_count': 1}]\n",
      "195 ;  [{'client_count': 0}]\n",
      "196 ;  [{'client_count': 0}]\n",
      "197 ;  [{'client_count': 1}]\n",
      "198 ;  [{'client_count': 0}]\n",
      "199 ;  [{'client_count': 0}]\n",
      "200 ;  [{'client_count': 0}]\n",
      "201 ;  [{'client_count': 0}]\n",
      "202 ;  [{'client_count': 0}]\n",
      "203 ;  [{'client_count': 0}]\n",
      "204 ;  [{'client_count': 0}]\n",
      "205 ;  [{'client_count': 0}]\n",
      "206 ;  [{'client_count': 0}]\n",
      "207 ;  [{'client_count': 1}]\n",
      "208 ;  [{'client_count': 1}]\n",
      "209 ;  [{'client_count': 0}]\n",
      "210 ;  [{'client_count': 0}]\n",
      "211 ;  [{'client_count': 1}]\n",
      "212 ;  [{'client_count': 1}]\n",
      "213 ;  [{'client_count': 0}]\n",
      "214 ;  [{'client_count': 1}]\n",
      "215 ;  [{'client_count': 1}]\n",
      "216 ;  [{'client_count': 1}]\n",
      "217 ;  [{'client_count': 1}]\n",
      "218 ;  [{'client_count': 0}]\n",
      "219 ;  [{'client_count': 1}]\n",
      "220 ;  [{'client_count': 1}]\n",
      "221 ;  [{'client_count': 0}]\n",
      "222 ;  [{'client_count': 0}]\n",
      "223 ;  [{'client_count': 1}]\n",
      "224 ;  [{'client_count': 0}]\n",
      "225 ;  [{'client_count': 0}]\n",
      "226 ;  [{'client_count': 1}]\n",
      "227 ;  [{'client_count': 0}]\n",
      "228 ;  [{'client_count': 0}]\n",
      "229 ;  [{'client_count': 0}]\n",
      "230 ;  [{'client_count': 1}]\n",
      "231 ;  [{'client_count': 1}]\n",
      "232 ;  [{'client_count': 1}]\n",
      "233 ;  [{'client_count': 1}]\n",
      "234 ;  [{'client_count': 0}]\n",
      "235 ;  [{'client_count': 0}]\n",
      "236 ;  [{'client_count': 1}]\n",
      "237 ;  [{'client_count': 1}]\n",
      "238 ;  [{'client_count': 1}]\n",
      "239 ;  [{'client_count': 1}]\n",
      "240 ;  [{'client_count': 1}]\n",
      "241 ;  [{'client_count': 1}]\n",
      "242 ;  [{'client_count': 1}]\n",
      "243 ;  [{'client_count': 1}]\n",
      "244 ;  [{'client_count': 0}]\n",
      "245 ;  [{'client_count': 1}]\n",
      "246 ;  [{'client_count': 1}]\n",
      "247 ;  [{'client_count': 1}]\n",
      "248 ;  [{'client_count': 1}]\n",
      "249 ;  [{'client_count': 1}]\n",
      "250 ;  [{'client_count': 1}]\n",
      "251 ;  [{'client_count': 1}]\n",
      "252 ;  [{'client_count': 0}]\n",
      "253 ;  [{'client_count': 0}]\n",
      "254 ;  [{'client_count': 1}]\n",
      "255 ;  [{'client_count': 0}]\n",
      "256 ;  [{'client_count': 1}]\n",
      "257 ;  [{'client_count': 1}]\n",
      "258 ;  [{'client_count': 0}]\n",
      "259 ;  [{'client_count': 0}]\n",
      "260 ;  [{'client_count': 1}]\n",
      "261 ;  [{'client_count': 0}]\n",
      "262 ;  [{'client_count': 1}]\n",
      "263 ;  [{'client_count': 0}]\n",
      "264 ;  [{'client_count': 1}]\n",
      "265 ;  [{'client_count': 0}]\n",
      "266 ;  [{'client_count': 1}]\n",
      "267 ;  [{'client_count': 0}]\n",
      "268 ;  [{'client_count': 1}]\n",
      "269 ;  [{'client_count': 1}]\n",
      "270 ;  [{'client_count': 0}]\n",
      "271 ;  [{'client_count': 0}]\n",
      "272 ;  [{'client_count': 1}]\n",
      "273 ;  [{'client_count': 1}]\n",
      "274 ;  [{'client_count': 1}]\n",
      "275 ;  [{'client_count': 0}]\n",
      "276 ;  [{'client_count': 0}]\n",
      "277 ;  [{'client_count': 0}]\n",
      "278 ;  [{'client_count': 1}]\n",
      "279 ;  [{'client_count': 1}]\n",
      "280 ;  [{'client_count': 0}]\n",
      "281 ;  [{'client_count': 0}]\n",
      "282 ;  [{'client_count': 0}]\n",
      "283 ;  [{'client_count': 1}]\n",
      "284 ;  [{'client_count': 0}]\n",
      "285 ;  [{'client_count': 0}]\n",
      "286 ;  [{'client_count': 1}]\n",
      "287 ;  [{'client_count': 0}]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "288 ;  [{'client_count': 0}]\n",
      "289 ;  [{'client_count': 0}]\n",
      "290 ;  [{'client_count': 1}]\n",
      "291 ;  [{'client_count': 1}]\n",
      "292 ;  [{'client_count': 0}]\n",
      "293 ;  [{'client_count': 0}]\n",
      "294 ;  [{'client_count': 1}]\n",
      "295 ;  [{'client_count': 1}]\n",
      "296 ;  [{'client_count': 0}]\n",
      "297 ;  [{'client_count': 0}]\n",
      "298 ;  [{'client_count': 1}]\n",
      "299 ;  [{'client_count': 0}]\n",
      "300 ;  [{'client_count': 1}]\n",
      "301 ;  [{'client_count': 0}]\n",
      "302 ;  [{'client_count': 1}]\n",
      "303 ;  [{'client_count': 0}]\n",
      "304 ;  [{'client_count': 0}]\n",
      "305 ;  [{'client_count': 1}]\n",
      "306 ;  [{'client_count': 1}]\n",
      "307 ;  [{'client_count': 0}]\n",
      "308 ;  [{'client_count': 0}]\n",
      "309 ;  [{'client_count': 1}]\n",
      "310 ;  [{'client_count': 1}]\n",
      "311 ;  [{'client_count': 1}]\n",
      "312 ;  [{'client_count': 1}]\n",
      "313 ;  [{'client_count': 1}]\n",
      "314 ;  [{'client_count': 0}]\n",
      "315 ;  [{'client_count': 0}]\n",
      "316 ;  [{'client_count': 1}]\n",
      "317 ;  [{'client_count': 1}]\n",
      "318 ;  [{'client_count': 1}]\n",
      "319 ;  [{'client_count': 1}]\n",
      "320 ;  [{'client_count': 1}]\n",
      "321 ;  [{'client_count': 0}]\n",
      "322 ;  [{'client_count': 1}]\n",
      "323 ;  [{'client_count': 1}]\n",
      "324 ;  [{'client_count': 1}]\n",
      "325 ;  [{'client_count': 1}]\n",
      "326 ;  [{'client_count': 1}]\n",
      "327 ;  [{'client_count': 1}]\n",
      "328 ;  [{'client_count': 1}]\n",
      "329 ;  [{'client_count': 1}]\n",
      "330 ;  [{'client_count': 0}]\n",
      "331 ;  [{'client_count': 1}]\n",
      "332 ;  [{'client_count': 1}]\n",
      "333 ;  [{'client_count': 0}]\n",
      "334 ;  [{'client_count': 1}]\n",
      "335 ;  [{'client_count': 1}]\n",
      "336 ;  [{'client_count': 0}]\n",
      "337 ;  [{'client_count': 1}]\n",
      "338 ;  [{'client_count': 1}]\n",
      "339 ;  [{'client_count': 0}]\n",
      "340 ;  [{'client_count': 0}]\n",
      "341 ;  [{'client_count': 1}]\n",
      "342 ;  [{'client_count': 0}]\n",
      "343 ;  [{'client_count': 1}]\n",
      "344 ;  [{'client_count': 0}]\n",
      "345 ;  [{'client_count': 1}]\n",
      "346 ;  [{'client_count': 1}]\n",
      "347 ;  [{'client_count': 1}]\n",
      "348 ;  [{'client_count': 1}]\n",
      "349 ;  [{'client_count': 1}]\n",
      "350 ;  [{'client_count': 0}]\n",
      "351 ;  [{'client_count': 0}]\n",
      "352 ;  [{'client_count': 0}]\n",
      "353 ;  [{'client_count': 0}]\n",
      "354 ;  [{'client_count': 1}]\n",
      "355 ;  [{'client_count': 1}]\n",
      "356 ;  [{'client_count': 1}]\n",
      "357 ;  [{'client_count': 1}]\n",
      "358 ;  [{'client_count': 1}]\n",
      "359 ;  [{'client_count': 0}]\n",
      "360 ;  [{'client_count': 1}]\n",
      "361 ;  [{'client_count': 1}]\n",
      "362 ;  [{'client_count': 0}]\n",
      "363 ;  [{'client_count': 1}]\n",
      "364 ;  [{'client_count': 0}]\n",
      "365 ;  [{'client_count': 1}]\n",
      "366 ;  [{'client_count': 0}]\n",
      "367 ;  [{'client_count': 1}]\n",
      "368 ;  [{'client_count': 0}]\n",
      "369 ;  [{'client_count': 1}]\n",
      "370 ;  [{'client_count': 1}]\n",
      "371 ;  [{'client_count': 0}]\n",
      "372 ;  [{'client_count': 1}]\n",
      "373 ;  [{'client_count': 0}]\n",
      "374 ;  [{'client_count': 1}]\n",
      "375 ;  [{'client_count': 1}]\n",
      "376 ;  [{'client_count': 0}]\n",
      "377 ;  [{'client_count': 0}]\n",
      "378 ;  [{'client_count': 1}]\n",
      "379 ;  [{'client_count': 1}]\n",
      "380 ;  [{'client_count': 0}]\n",
      "381 ;  [{'client_count': 1}]\n",
      "382 ;  [{'client_count': 1}]\n",
      "383 ;  [{'client_count': 0}]\n",
      "384 ;  [{'client_count': 0}]\n",
      "385 ;  [{'client_count': 1}]\n",
      "386 ;  [{'client_count': 0}]\n",
      "387 ;  [{'client_count': 1}]\n",
      "388 ;  [{'client_count': 0}]\n",
      "389 ;  [{'client_count': 1}]\n",
      "390 ;  [{'client_count': 1}]\n",
      "391 ;  [{'client_count': 1}]\n",
      "392 ;  [{'client_count': 0}]\n",
      "393 ;  [{'client_count': 1}]\n",
      "394 ;  [{'client_count': 0}]\n",
      "395 ;  [{'client_count': 1}]\n",
      "396 ;  [{'client_count': 0}]\n",
      "397 ;  [{'client_count': 0}]\n",
      "398 ;  [{'client_count': 1}]\n",
      "399 ;  [{'client_count': 1}]\n",
      "400 ;  [{'client_count': 0}]\n",
      "401 ;  [{'client_count': 1}]\n",
      "402 ;  [{'client_count': 1}]\n",
      "403 ;  [{'client_count': 0}]\n",
      "404 ;  [{'client_count': 0}]\n",
      "405 ;  [{'client_count': 1}]\n",
      "406 ;  [{'client_count': 1}]\n",
      "407 ;  [{'client_count': 1}]\n",
      "408 ;  [{'client_count': 1}]\n",
      "409 ;  [{'client_count': 0}]\n",
      "410 ;  [{'client_count': 0}]\n",
      "411 ;  [{'client_count': 1}]\n",
      "412 ;  [{'client_count': 0}]\n",
      "413 ;  [{'client_count': 1}]\n",
      "414 ;  [{'client_count': 1}]\n",
      "415 ;  [{'client_count': 0}]\n",
      "416 ;  [{'client_count': 1}]\n",
      "417 ;  [{'client_count': 0}]\n",
      "418 ;  [{'client_count': 0}]\n",
      "419 ;  [{'client_count': 1}]\n",
      "420 ;  [{'client_count': 0}]\n",
      "421 ;  [{'client_count': 0}]\n",
      "422 ;  [{'client_count': 1}]\n",
      "423 ;  [{'client_count': 1}]\n",
      "424 ;  [{'client_count': 0}]\n",
      "425 ;  [{'client_count': 0}]\n",
      "426 ;  [{'client_count': 0}]\n",
      "427 ;  [{'client_count': 1}]\n",
      "428 ;  [{'client_count': 1}]\n",
      "429 ;  [{'client_count': 1}]\n",
      "430 ;  [{'client_count': 0}]\n",
      "431 ;  [{'client_count': 1}]\n",
      "432 ;  [{'client_count': 1}]\n",
      "433 ;  [{'client_count': 1}]\n",
      "434 ;  [{'client_count': 1}]\n",
      "435 ;  [{'client_count': 1}]\n",
      "436 ;  [{'client_count': 0}]\n",
      "437 ;  [{'client_count': 1}]\n",
      "438 ;  [{'client_count': 0}]\n",
      "439 ;  [{'client_count': 0}]\n",
      "440 ;  [{'client_count': 1}]\n",
      "441 ;  [{'client_count': 0}]\n",
      "442 ;  [{'client_count': 0}]\n",
      "443 ;  [{'client_count': 0}]\n",
      "444 ;  [{'client_count': 0}]\n",
      "445 ;  [{'client_count': 1}]\n",
      "446 ;  [{'client_count': 0}]\n",
      "447 ;  [{'client_count': 0}]\n",
      "448 ;  [{'client_count': 1}]\n",
      "449 ;  [{'client_count': 1}]\n",
      "450 ;  [{'client_count': 1}]\n",
      "451 ;  [{'client_count': 1}]\n",
      "452 ;  [{'client_count': 1}]\n",
      "453 ;  [{'client_count': 1}]\n",
      "454 ;  [{'client_count': 1}]\n",
      "455 ;  [{'client_count': 1}]\n",
      "456 ;  [{'client_count': 0}]\n",
      "457 ;  [{'client_count': 0}]\n",
      "458 ;  [{'client_count': 0}]\n",
      "459 ;  [{'client_count': 1}]\n",
      "460 ;  [{'client_count': 1}]\n",
      "461 ;  [{'client_count': 0}]\n",
      "462 ;  [{'client_count': 1}]\n",
      "463 ;  [{'client_count': 1}]\n",
      "464 ;  [{'client_count': 1}]\n",
      "465 ;  [{'client_count': 0}]\n",
      "466 ;  [{'client_count': 1}]\n",
      "467 ;  [{'client_count': 1}]\n",
      "468 ;  [{'client_count': 1}]\n",
      "469 ;  [{'client_count': 1}]\n",
      "470 ;  [{'client_count': 0}]\n",
      "471 ;  [{'client_count': 1}]\n",
      "472 ;  [{'client_count': 0}]\n",
      "473 ;  [{'client_count': 1}]\n",
      "474 ;  [{'client_count': 0}]\n",
      "475 ;  [{'client_count': 1}]\n",
      "476 ;  [{'client_count': 0}]\n",
      "477 ;  [{'client_count': 1}]\n",
      "478 ;  [{'client_count': 1}]\n",
      "479 ;  [{'client_count': 1}]\n",
      "480 ;  [{'client_count': 1}]\n",
      "481 ;  [{'client_count': 0}]\n",
      "482 ;  [{'client_count': 1}]\n",
      "483 ;  [{'client_count': 1}]\n",
      "484 ;  [{'client_count': 1}]\n",
      "485 ;  [{'client_count': 0}]\n",
      "486 ;  [{'client_count': 0}]\n",
      "487 ;  [{'client_count': 1}]\n",
      "488 ;  [{'client_count': 1}]\n",
      "489 ;  [{'client_count': 1}]\n",
      "490 ;  [{'client_count': 1}]\n",
      "491 ;  [{'client_count': 0}]\n",
      "492 ;  [{'client_count': 1}]\n",
      "493 ;  [{'client_count': 0}]\n",
      "494 ;  [{'client_count': 0}]\n",
      "495 ;  [{'client_count': 0}]\n",
      "496 ;  [{'client_count': 0}]\n",
      "497 ;  [{'client_count': 1}]\n",
      "498 ;  [{'client_count': 1}]\n",
      "499 ;  [{'client_count': 1}]\n",
      "500 ;  [{'client_count': 1}]\n",
      "501 ;  [{'client_count': 0}]\n",
      "502 ;  [{'client_count': 0}]\n",
      "503 ;  [{'client_count': 0}]\n",
      "504 ;  [{'client_count': 0}]\n",
      "505 ;  [{'client_count': 1}]\n",
      "506 ;  [{'client_count': 1}]\n",
      "507 ;  [{'client_count': 0}]\n",
      "508 ;  [{'client_count': 1}]\n",
      "509 ;  [{'client_count': 0}]\n",
      "510 ;  [{'client_count': 1}]\n",
      "511 ;  [{'client_count': 0}]\n",
      "512 ;  [{'client_count': 0}]\n",
      "513 ;  [{'client_count': 1}]\n",
      "514 ;  [{'client_count': 0}]\n",
      "515 ;  [{'client_count': 0}]\n",
      "516 ;  [{'client_count': 0}]\n",
      "517 ;  [{'client_count': 0}]\n",
      "518 ;  [{'client_count': 0}]\n",
      "519 ;  [{'client_count': 1}]\n",
      "520 ;  [{'client_count': 1}]\n",
      "521 ;  [{'client_count': 0}]\n",
      "522 ;  [{'client_count': 1}]\n",
      "523 ;  [{'client_count': 1}]\n",
      "524 ;  [{'client_count': 1}]\n",
      "525 ;  [{'client_count': 1}]\n",
      "526 ;  [{'client_count': 1}]\n",
      "527 ;  [{'client_count': 1}]\n",
      "528 ;  [{'client_count': 1}]\n",
      "529 ;  [{'client_count': 0}]\n",
      "530 ;  [{'client_count': 1}]\n",
      "531 ;  [{'client_count': 1}]\n",
      "532 ;  [{'client_count': 1}]\n",
      "533 ;  [{'client_count': 0}]\n",
      "534 ;  [{'client_count': 0}]\n",
      "535 ;  [{'client_count': 1}]\n",
      "536 ;  [{'client_count': 0}]\n",
      "537 ;  [{'client_count': 1}]\n",
      "538 ;  [{'client_count': 1}]\n",
      "539 ;  [{'client_count': 1}]\n",
      "540 ;  [{'client_count': 0}]\n",
      "541 ;  [{'client_count': 1}]\n",
      "542 ;  [{'client_count': 0}]\n",
      "543 ;  [{'client_count': 1}]\n",
      "544 ;  [{'client_count': 0}]\n",
      "545 ;  [{'client_count': 1}]\n",
      "546 ;  [{'client_count': 1}]\n",
      "547 ;  [{'client_count': 0}]\n",
      "548 ;  [{'client_count': 1}]\n",
      "549 ;  [{'client_count': 0}]\n",
      "550 ;  [{'client_count': 0}]\n",
      "551 ;  [{'client_count': 1}]\n",
      "552 ;  [{'client_count': 0}]\n",
      "553 ;  [{'client_count': 0}]\n",
      "554 ;  [{'client_count': 0}]\n",
      "555 ;  [{'client_count': 0}]\n",
      "556 ;  [{'client_count': 0}]\n",
      "557 ;  [{'client_count': 0}]\n",
      "558 ;  [{'client_count': 1}]\n",
      "559 ;  [{'client_count': 1}]\n",
      "560 ;  [{'client_count': 1}]\n",
      "561 ;  [{'client_count': 1}]\n",
      "562 ;  [{'client_count': 1}]\n",
      "563 ;  [{'client_count': 1}]\n",
      "564 ;  [{'client_count': 1}]\n",
      "565 ;  [{'client_count': 0}]\n",
      "566 ;  [{'client_count': 1}]\n",
      "567 ;  [{'client_count': 0}]\n",
      "568 ;  [{'client_count': 1}]\n",
      "569 ;  [{'client_count': 0}]\n",
      "570 ;  [{'client_count': 1}]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "571 ;  [{'client_count': 0}]\n",
      "572 ;  [{'client_count': 0}]\n",
      "573 ;  [{'client_count': 0}]\n",
      "574 ;  [{'client_count': 1}]\n",
      "575 ;  [{'client_count': 1}]\n",
      "576 ;  [{'client_count': 1}]\n",
      "577 ;  [{'client_count': 1}]\n",
      "578 ;  [{'client_count': 1}]\n",
      "579 ;  [{'client_count': 1}]\n",
      "580 ;  [{'client_count': 1}]\n",
      "581 ;  [{'client_count': 0}]\n",
      "582 ;  [{'client_count': 0}]\n",
      "583 ;  [{'client_count': 0}]\n",
      "584 ;  [{'client_count': 1}]\n",
      "585 ;  [{'client_count': 1}]\n",
      "586 ;  [{'client_count': 1}]\n",
      "587 ;  [{'client_count': 1}]\n",
      "588 ;  [{'client_count': 1}]\n",
      "589 ;  [{'client_count': 1}]\n",
      "590 ;  [{'client_count': 1}]\n",
      "591 ;  [{'client_count': 0}]\n",
      "592 ;  [{'client_count': 0}]\n",
      "593 ;  [{'client_count': 1}]\n",
      "594 ;  [{'client_count': 1}]\n",
      "595 ;  [{'client_count': 0}]\n",
      "596 ;  [{'client_count': 1}]\n",
      "597 ;  [{'client_count': 0}]\n",
      "598 ;  [{'client_count': 0}]\n",
      "599 ;  [{'client_count': 0}]\n",
      "600 ;  [{'client_count': 0}]\n",
      "601 ;  [{'client_count': 1}]\n",
      "602 ;  [{'client_count': 0}]\n",
      "603 ;  [{'client_count': 1}]\n",
      "604 ;  [{'client_count': 0}]\n",
      "605 ;  [{'client_count': 1}]\n",
      "606 ;  [{'client_count': 1}]\n",
      "607 ;  [{'client_count': 0}]\n",
      "608 ;  [{'client_count': 0}]\n",
      "609 ;  [{'client_count': 0}]\n",
      "610 ;  [{'client_count': 0}]\n",
      "611 ;  [{'client_count': 1}]\n",
      "612 ;  [{'client_count': 1}]\n",
      "613 ;  [{'client_count': 0}]\n",
      "614 ;  [{'client_count': 1}]\n",
      "615 ;  [{'client_count': 1}]\n",
      "616 ;  [{'client_count': 0}]\n",
      "617 ;  [{'client_count': 1}]\n",
      "618 ;  [{'client_count': 0}]\n",
      "619 ;  [{'client_count': 1}]\n",
      "620 ;  [{'client_count': 1}]\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-132-ac1177124f77>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      3\u001b[0m     \u001b[0mcounter\u001b[0m\u001b[0;34m+=\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m     \u001b[0mneo4j_query\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mneo4j_query_fn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrow\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 5\u001b[0;31m     \u001b[0mdata\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mneo4j_query\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      6\u001b[0m     \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcounter\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m'; '\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    524\u001b[0m         \u001b[0;34m:\u001b[0m\u001b[0;32mreturn\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    525\u001b[0m         \"\"\"\n\u001b[0;32m--> 526\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbegin\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mautocommit\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    527\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    528\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mseparate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msubgraph\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    803\u001b[0m                                              \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    804\u001b[0m                                              \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 805\u001b[0;31m                                              entities=entities))\n\u001b[0m\u001b[1;32m    806\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mCypherError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    807\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0;34m\"code\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"message\"\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, statement, parameters, tx, graph, keys, entities)\u001b[0m\n\u001b[1;32m    283\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    284\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtx\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 285\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_1\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    286\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    287\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run_in_tx\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_run_1\u001b[0;34m(self, statement, parameters, graph, keys, entities)\u001b[0m\n\u001b[1;32m    246\u001b[0m                     on_success=result.update_metadata, on_failure=self._fail, on_summary=result.done)\n\u001b[1;32m    247\u001b[0m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 248\u001b[0;31m         \u001b[0mcx\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    249\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    250\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    417\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    418\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 419\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    420\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    438\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    439\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 440\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_receive\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    441\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    442\u001b[0m         \u001b[0mdetails\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_unpack\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_receive\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    487\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    488\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0mreceived\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m-\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 489\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    490\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    491\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_unpack\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "counter=0\n",
    "for index, row in CLM_GB_CUSTOMERS_BASE_REPORT_df.iterrows():\n",
    "    counter+=1\n",
    "    neo4j_query=neo4j_query_fn(row)\n",
    "    data=graph.run(neo4j_query).data()\n",
    "    print(counter,'; ',data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'MATCH (client:GreenBacks) WHERE client.dedupestatic=\\'1.10000015709e+11\\'\\n    SET client.CLM_ENROL_DATE = coalesce(date(\\'2019-09-13\\'),\"not applicable\"),\\n    client.ENROLMENT_CHANNEL = coalesce(\\'B\\',\"not applicable\"),\\n    client.STATUS = coalesce(\\'A\\',\"not applicable\"),\\n    client.IREWARDS_NO = coalesce(toInteger(950710155147.0),\"not applicable\"),\\n    client.CLM_REWARDS_NUMBER = coalesce(toInteger(460000091765),\"not applicable\"),\\n    client.AFFINITY = coalesce(\\'nan\\',\"not applicable\"),\\n\\n    client.GB_APP_DOWNLOAD = coalesce(toInteger(0.0),\"not applicable\"),\\n    client.MONEY_APP_DOWNLOAD = coalesce(toInteger(1.0),\"not applicable\"),\\n\\n    client.CARD_SWIPER_ELIGIBLE = coalesce(toInteger(1.0),\"not applicable\"),\\n    client.CARD_SWIPER_OPTED = coalesce(toInteger(1),\"not applicable\"),\\n    client.CARD_SWIPER_OPTED_DATE=coalesce(date(\\'2019-09-13\\'),\"not applicable\"),\\n\\n    client.MONEY_MANAGER_ELIGIBLE=coalesce(toInteger(1),\"not applicable\"),\\n    client.MONEY_MANAGER_OPTED=coalesce(toInteger(0),\"not applicable\"),\\n    client.MONEY_MANAGER_OPTED_DATE = coalesce(date(\\'nan\\'),\"not applicable\"),\\n\\n    client.RESPONSIBLE_BORROWER_ELIGIBLE = coalesce(toInteger(1),\"not applicable\"),\\n    client.RESPONSIBLE_BORROWER_OPTED = coalesce(toInteger(0),\"not applicable\"),\\n    client.RESPONSIBLE_BORROWER_OPTED_DATE = coalesce(date(\\'nan\\'),\"not applicable\"),\\n\\n    client.GREENBACKS = coalesce(toInteger(134730.0),\"not applicable\"),\\n    client.PROBABILISTIC = coalesce(toInteger(180.0),\"not applicable\"),\\n    client.CAMPAIGN_POINTS = coalesce(toInteger(\\'nan\\'),\"not applicable\"),\\n    client.GREENBACKS_RANDVALUE = coalesce(toFloat(\\'3772.44\\'),\"not applicable\"),\\n\\n    client.PROBABILISTIC_RANDVALUE = coalesce(toFloat(5.04),\"not applicable\"),\\n    client.GREENBACKS_RANDRANGE = coalesce(\\'> R1000\\',\"not applicable\"),\\n    client.PROBABILISTIC_RANDRANGE = coalesce(\\'R0 up to R50\\',\"not applicable\")\\n    RETURN count(client) AS client_count;\\n\\n    '"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_query=\"\"\"MATCH (n:Client) WHERE n.dedupestatic='{dedupestatic}' \n",
    "SET n.CLM_ENROL_DATE = date('{CLM_ENROL_DATE}')\n",
    "RETURN n LIMIT 25\"\"\".format(dedupestatic=dedupestatic)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
