{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "check out gephi.cql and behaviour_desktop.md"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "/media/lnr-ai/applications/./neo4j-desktop-offline-1.2.7-x86_64.AppImage"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Is the Neo4J db up and running?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nodes': [(_-4:Company {constraints: ['CONSTRAINT ON ( company:Company ) ASSERT (company.companyname) IS UNIQUE'], indexes: [], name: 'Company'}),\n",
       "   (_-2:Merchant {constraints: ['CONSTRAINT ON ( merchant:Merchant ) ASSERT (merchant.franchisename) IS UNIQUE'], indexes: [], name: 'Merchant'}),\n",
       "   (_-1:Client {constraints: ['CONSTRAINT ON ( client:Client ) ASSERT (client.dedupestatic) IS UNIQUE'], indexes: [], name: 'Client'}),\n",
       "   (_-3:Segment {constraints: ['CONSTRAINT ON ( segment:Segment ) ASSERT (segment.seg_l3_num) IS UNIQUE'], indexes: [], name: 'Segment'})],\n",
       "  'relationships': [(Client)-[:CLIENT_LINK_7916 {}]->(Client),\n",
       "   (Client)-[:TRANSACTED_AT {}]->(Merchant),\n",
       "   (Client)-[:CLIENT_LINK {}]->(Client),\n",
       "   (Client)-[:COMPANY_TRANSACTED_AT {}]->(Company),\n",
       "   (Company)-[:COMPANY_LINK {}]->(Company),\n",
       "   (Merchant)-[:MERCHANT_VALUE_LINK {}]->(Merchant),\n",
       "   (Merchant)-[:MERCHANT_LINK {}]->(Merchant),\n",
       "   (Merchant)-[:TRIADIC_MERCHANT_FEET_LINK {}]->(Merchant),\n",
       "   (Merchant)-[:MERCHANT_FEET_LINK {}]->(Merchant)]}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"CALL db.schema.visualization()\").data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4j_query=\"\"\"\n",
    "MATCH (m:Merchant {subclass_id:56101})\n",
    "WHERE EXISTS(m.triadic_56101_community) \n",
    "RETURN COUNT(m.triadic_56101_community) as membercount, m.triadic_56101_community as triadic_56101_community\n",
    "ORDER BY membercount ASC;\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "df=graph.run(neo4j_query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>membercount</th>\n",
       "      <th>triadic_56101_community</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>9724</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>9725</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5127</th>\n",
       "      <td>351</td>\n",
       "      <td>5936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5128</th>\n",
       "      <td>364</td>\n",
       "      <td>6365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5129</th>\n",
       "      <td>398</td>\n",
       "      <td>8188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5130</th>\n",
       "      <td>517</td>\n",
       "      <td>1772</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5131</th>\n",
       "      <td>765</td>\n",
       "      <td>5989</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5132 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      membercount  triadic_56101_community\n",
       "0               1                        0\n",
       "1               1                     9724\n",
       "2               1                        1\n",
       "3               1                     9725\n",
       "4               1                        6\n",
       "...           ...                      ...\n",
       "5127          351                     5936\n",
       "5128          364                     6365\n",
       "5129          398                     8188\n",
       "5130          517                     1772\n",
       "5131          765                     5989\n",
       "\n",
       "[5132 rows x 2 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "triadic_56101_community_list=list(df[df.membercount>20].triadic_56101_community)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "24"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(triadic_56101_community_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Doing community 7916, 0 of 24\n",
      "graph doesn't exist!\n",
      "      franchisename     score  community  membercount\n",
      "0      KFC GROBLERS  0.809422       7916           25\n",
      "1    NANDOS GROBLER  0.670787       7916           25\n",
      "2      DEBONAIRS SI  0.660889       7916           25\n",
      "3      KFC MOUTSIYA  0.601046       7916           25\n",
      "4    WIMPY GROBLERS  0.575624       7916           25\n",
      "5      KFC KWAGGAFO  0.470889       7916           25\n",
      "6    STEERS MORATIW  0.441075       7916           25\n",
      "7    DEBONAIRS GROB  0.394640       7916           25\n",
      "8        KFC MOLOTO  0.277500       7916           25\n",
      "9      McD Kwagga M  0.267938       7916           25\n",
      "10     McD Groblers  0.259299       7916           25\n",
      "11     KFC MOUTSE M  0.232283       7916           25\n",
      "12   KFC MOUTSIYA M  0.213750       7916           25\n",
      "13     KFC PHOLA PA  0.195549       7916           25\n",
      "14   DEBONAIRS MORA  0.186734       7916           25\n",
      "15   DEBONAIRS SIYA  0.186734       7916           25\n",
      "16   DEBONAIRS JANE  0.150000       7916           25\n",
      "17   KFC GROBLERSDA  0.150000       7916           25\n",
      "18     KFC JANE FUR  0.150000       7916           25\n",
      "19     KFC MARBLE H  0.150000       7916           25\n",
      "20     KFC Moratiwa  0.150000       7916           25\n",
      "21   KFC PHOLA PARK  0.150000       7916           25\n",
      "22     KFC SIYABUSW  0.150000       7916           25\n",
      "23    KFC SIYABUSWA  0.150000       7916           25\n",
      "24  McD Groblersdal  0.150000       7916           25\n",
      "Delete graph fastfood_7916...\n",
      "[2697, 6246, 6305, 6314, 290, 6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 2697, 1 of 24\n",
      "graph doesn't exist!\n",
      "             franchisename     score  community  membercount\n",
      "0           MCD Phuthaditj  1.251080       2697           30\n",
      "1           KENTUCKY FRIED  1.226924       2697           30\n",
      "2             KFC BETHLEHE  1.041206       2697           30\n",
      "3             WIMPY NEW MA  0.638840       2697           30\n",
      "4           KFC PHUTHADITJ  0.477074       2697           30\n",
      "5            Nandos Maluti  0.426250       2697           30\n",
      "6             KFC Ficksbur  0.331967       2697           30\n",
      "7           STEERS BETHLEH  0.324753       2697           30\n",
      "8           Nandos Bethleh  0.320392       2697           30\n",
      "9           Nandos Harrism  0.276511       2697           30\n",
      "10          WIMPY RESTAURA  0.244259       2697           30\n",
      "11          DEBONAIRS METR  0.223689       2697           30\n",
      "12          STEERS SETSING  0.223009       2697           30\n",
      "13          DEBONAIRS BETH  0.205055       2697           30\n",
      "14          WIMPY WES - VI  0.204467       2697           30\n",
      "15            WATASHI SPUR  0.201759       2697           30\n",
      "16            WIMPY BETHLE  0.183805       2697           30\n",
      "17        Nandos Bethlehem  0.171250       2697           30\n",
      "18            SPUR WATASHI  0.165590       2697           30\n",
      "19  CHICKEN LICKEN PHUTHAS  0.150000       2697           30\n",
      "20          Debonairs Berg  0.150000       2697           30\n",
      "21           KFC BETHLEHEM  0.150000       2697           30\n",
      "22            KFC HEILBRON  0.150000       2697           30\n",
      "23            KFC NORTHRID  0.150000       2697           30\n",
      "24             KFC QWA QWA  0.150000       2697           30\n",
      "25             KFC SENEKAL  0.150000       2697           30\n",
      "26     MCD Phuthaditjha ()  0.150000       2697           30\n",
      "27          SEDIBENG WIMPY  0.150000       2697           30\n",
      "28          WIMPY BETHLEHE  0.150000       2697           30\n",
      "29          WIMPY TAKE AWA  0.150000       2697           30\n",
      "Delete graph fastfood_2697...\n",
      "[6246, 6305, 6314, 290, 6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6246, 2 of 24\n",
      "graph doesn't exist!\n",
      "           franchisename     score  community  membercount\n",
      "0           STEERS VENTE  0.912108       6246           32\n",
      "1           NANDOS - MAF  0.789356       6246           32\n",
      "2           KFC LICHTENB  0.649413       6246           32\n",
      "3         NANDOS - ZEERU  0.589646       6246           32\n",
      "4         MCDONALDS CROS  0.495655       6246           32\n",
      "5           KFC VENTERSD  0.426000       6246           32\n",
      "6    CHICKEN LICKEN MEGA  0.420663       6246           32\n",
      "7         MCD Mafikeng F  0.407622       6246           32\n",
      "8         STEERS LICHTEN  0.404957       6246           32\n",
      "9           STEERS AND F  0.403364       6246           32\n",
      "10          DEBONAIRS EX  0.298046       6246           32\n",
      "11          DEBONAIRS MA  0.281474       6246           32\n",
      "12        MCD Mafikeng (  0.273298       6246           32\n",
      "13          WIMPY CHOPPI  0.266373       6246           32\n",
      "14          KFC MMABATHO  0.236265       6246           32\n",
      "15          STEERS ZEERU  0.235715       6246           32\n",
      "16          WIMPY MAFIKE  0.227898       6246           32\n",
      "17    DEBONAIRS MAFIKENG  0.227385       6246           32\n",
      "18          WIMPY LICHTE  0.196461       6246           32\n",
      "19    MCD Mafikeng FS ()  0.181875       6246           32\n",
      "20          WIMPY THE CR  0.177691       6246           32\n",
      "21          KFC MAFIKENG  0.160625       6246           32\n",
      "22       MCD Mafikeng ()  0.160625       6246           32\n",
      "23            NANDOS MFK  0.160625       6246           32\n",
      "24    WIMPY THE CROSSING  0.160625       6246           32\n",
      "25  CHICKEN LICKEN MOLOP  0.150000       6246           32\n",
      "26          KFC CROSSING  0.150000       6246           32\n",
      "27          KFC DELAREYV  0.150000       6246           32\n",
      "28       KFC LICHTENBURG  0.150000       6246           32\n",
      "29           KFC ZEERUST  0.150000       6246           32\n",
      "30           LAGUNA SPUR  0.150000       6246           32\n",
      "31        McDONALDS MAFI  0.150000       6246           32\n",
      "Delete graph fastfood_6246...\n",
      "[6305, 6314, 290, 6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6305, 3 of 24\n",
      "graph doesn't exist!\n",
      "             franchisename     score  community  membercount\n",
      "0           STEERS RESTAUR  1.426281       6305           44\n",
      "1           MCDONALDS WORC  1.232959       6305           44\n",
      "2             KFC COLESBER  1.206734       6305           44\n",
      "3            MCD Worcester  0.818471       6305           44\n",
      "4             KFC LAINGSBU  0.791039       6305           44\n",
      "5            WIMPY  STOP C  0.770963       6305           44\n",
      "6             KFC ROBERTSO  0.718325       6305           44\n",
      "7             KFC WORCHEST  0.607055       6305           44\n",
      "8           WIMPY SWELLEND  0.591769       6305           44\n",
      "9             KFC MOUNTAIN  0.569577       6305           44\n",
      "10          MCD Beaufort W  0.508710       6305           44\n",
      "11            SPUR ROCKY R  0.418481       6305           44\n",
      "12            KFC BEAUFORT  0.406999       6305           44\n",
      "13            WIMPY HIGH S  0.397475       6305           44\n",
      "14          WIMPY ROBERTSO  0.389866       6305           44\n",
      "15          SPUR WORCESTER  0.377318       6305           44\n",
      "16          STEERS MOUNTAI  0.333728       6305           44\n",
      "17            WIMPY LAINSB  0.323925       6305           44\n",
      "18            KFC BREDASDO  0.321130       6305           44\n",
      "19          SPUR SAN DIEGO  0.295714       6305           44\n",
      "20            KFC VILLIERS  0.265316       6305           44\n",
      "21          KFC WORCHESTER  0.250088       6305           44\n",
      "22    STEERS MOUNTAIN MILL  0.223887       6305           44\n",
      "23     MCDONALDS WORCESTER  0.220858       6305           44\n",
      "24       KFC MOUNTAIN MILL  0.213750       6305           44\n",
      "25          SPUR SOUTH WOR  0.205319       6305           44\n",
      "26     DEBONAIRS WORCESTER  0.187549       6305           44\n",
      "27             WIMPY CERES  0.187549       6305           44\n",
      "28          WIMPY MOUNTAIN  0.187549       6305           44\n",
      "29           KFC ROBERTSON  0.169335       6305           44\n",
      "30             KFC SWELLEN  0.169335       6305           44\n",
      "31          STEERS ROBERTS  0.169335       6305           44\n",
      "32          DEBONAIRS BEAU  0.150000       6305           44\n",
      "33          DEBONAIRS CERE  0.150000       6305           44\n",
      "34          DEBONAIRS WORC  0.150000       6305           44\n",
      "35               KFC CERES  0.150000       6305           44\n",
      "36            KFC TUGELA N  0.150000       6305           44\n",
      "37            KFC TUGELA S  0.150000       6305           44\n",
      "38        MCD Worcester ()  0.150000       6305           44\n",
      "39          McDONALDS BEAU  0.150000       6305           44\n",
      "40    SPUR SOUTH WORCESTER  0.150000       6305           44\n",
      "41          STEERS TOUWSRI  0.150000       6305           44\n",
      "42  WIMPY MOUNTAIN MILL MA  0.150000       6305           44\n",
      "43            WYOMING SPUR  0.150000       6305           44\n",
      "Delete graph fastfood_6305...\n",
      "[6314, 290, 6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6314, 4 of 24\n",
      "graph doesn't exist!\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "             franchisename     score  community  membercount\n",
      "0             WIMPY GOUDKO  3.199500       6314           55\n",
      "1           WIMPY MOOI RIV  2.848526       6314           55\n",
      "2             STEERS FLAMW  1.239143       6314           55\n",
      "3             KFC MATLOLOS  1.139316       6314           55\n",
      "4           DEBONAIRS POTC  0.924155       6314           55\n",
      "5             KFC KLERKSDO  0.863793       6314           55\n",
      "6           BURGER KING MO  0.646359       6314           55\n",
      "7             McDONALDS PO  0.622306       6314           55\n",
      "8             STEERS COMBO  0.603526       6314           55\n",
      "9           Nandos Potchef  0.546116       6314           55\n",
      "10          DEBONAIRS KLER  0.521069       6314           55\n",
      "11          KFC POTCH GRIM  0.514512       6314           55\n",
      "12          MCD Klerksdorp  0.496245       6314           55\n",
      "13          KFC KLERKSDORP  0.479500       6314           55\n",
      "14            KFC WILKOPPI  0.442130       6314           55\n",
      "15            WIMPY MATLOS  0.432927       6314           55\n",
      "16            KFC ELANDSHE  0.428040       6314           55\n",
      "17            KFC POTCH GR  0.415708       6314           55\n",
      "18          KFC ELANDSHEUW  0.405087       6314           55\n",
      "19          NANDOS KLERKSD  0.376981       6314           55\n",
      "20            PIZZA HUT PO  0.371552       6314           55\n",
      "21          SPUR SILVER LI  0.355487       6314           55\n",
      "22          KFC POTCHEFSTR  0.328878       6314           55\n",
      "23            MOCHACHOS KL  0.317524       6314           55\n",
      "24          MCD Potchefstr  0.312376       6314           55\n",
      "25          SPUR ALBUQUERQ  0.264564       6314           55\n",
      "26            WIMPY N POTC  0.252627       6314           55\n",
      "27          ROCOMAMAS KLER  0.246712       6314           55\n",
      "28            KFC DIE BULT  0.240748       6314           55\n",
      "29          NANDOS POTCHEF  0.238160       6314           55\n",
      "30          SPUR BEAR CREE  0.236360       6314           55\n",
      "31        WIMPY WILKOPPIES  0.221099       6314           55\n",
      "32        KFC KLERKSDORP N  0.213024       6314           55\n",
      "33  CHICKEN LICKEN KLERKSD  0.210357       6314           55\n",
      "34            MONTANA SPUR  0.210357       6314           55\n",
      "35            KFC POTCHEFS  0.208822       6314           55\n",
      "36              KFC ORKNEY  0.201300       6314           55\n",
      "37            WIMPY WILKOP  0.192912       6314           55\n",
      "38          STEERS POTCHEF  0.190371       6314           55\n",
      "39            PIZZA HUT KL  0.190054       6314           55\n",
      "40          KFC WILKOPPIES  0.184584       6314           55\n",
      "41       NANDOS KLERKSDORP  0.184584       6314           55\n",
      "42           Steers Bailie  0.173511       6314           55\n",
      "43        WIMPY GOUDKOPPIE  0.167292       6314           55\n",
      "44       MCD Klerksdorp ()  0.162750       6314           55\n",
      "45           NANDOS LATHAM  0.162750       6314           55\n",
      "46         SPUR BEAR CREEK  0.162750       6314           55\n",
      "47   BURGER KING MOOIRIVER  0.150000       6314           55\n",
      "48  DEBONAIRS POTCHEFSTROO  0.150000       6314           55\n",
      "49             KFC IKAGENG  0.150000       6314           55\n",
      "50       KFC POTCH GRIMBEE  0.150000       6314           55\n",
      "51             KFC WOLLIES  0.150000       6314           55\n",
      "52           SPUR NEBRASKA  0.150000       6314           55\n",
      "53                  Steers  0.150000       6314           55\n",
      "54          WIMPY DIE BULT  0.150000       6314           55\n",
      "Delete graph fastfood_6314...\n",
      "[290, 6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 290, 5 of 24\n",
      "graph doesn't exist!\n",
      "            franchisename     score  community  membercount\n",
      "0          KFC IZINGOLWEN  1.787642        290           61\n",
      "1            MC DONALDS L  1.583697        290           61\n",
      "2          STEERS WILDCOA  1.057747        290           61\n",
      "3            WIMPY SHELLY  0.968718        290           61\n",
      "4          KFC PORT SHEPS  0.911042        290           61\n",
      "..                    ...       ...        ...          ...\n",
      "56        KFC SHELLY  BEA  0.150000        290           61\n",
      "57            KFC THULINI  0.150000        290           61\n",
      "58    McDONALDS LADYSMITH  0.150000        290           61\n",
      "59  Nandos Port Shepstone  0.150000        290           61\n",
      "60         WIMPY TED'S LA  0.150000        290           61\n",
      "\n",
      "[61 rows x 4 columns]\n",
      "Delete graph fastfood_290...\n",
      "[6790, 8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6790, 6 of 24\n",
      "graph doesn't exist!\n",
      "           franchisename     score  community  membercount\n",
      "0           KAUAI KIMBER  2.014884       6790           69\n",
      "1         McDonalds KIMB  1.910501       6790           69\n",
      "2         Debonairs Long  1.495959       6790           69\n",
      "3         WIMPY D/PAVILI  1.033754       6790           69\n",
      "4           MCDONALDS KA  1.006541       6790           69\n",
      "..                   ...       ...        ...          ...\n",
      "64           KFC KURUMAN  0.150000       6790           69\n",
      "65  KFC MONUMENT HEIGHTS  0.150000       6790           69\n",
      "66      Nandos Kimberley  0.150000       6790           69\n",
      "67            STEERS CBD  0.150000       6790           69\n",
      "68        WIMPY UPINGTON  0.150000       6790           69\n",
      "\n",
      "[69 rows x 4 columns]\n",
      "Delete graph fastfood_6790...\n",
      "[8577, 2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 8577, 7 of 24\n",
      "graph doesn't exist!\n",
      "           franchisename     score  community  membercount\n",
      "0           MCDONALD'S V  2.011277       8577           72\n",
      "1         STEERS VAAL MA  1.512435       8577           72\n",
      "2         KFC Vanderbijl  1.184150       8577           72\n",
      "3           WIMPY VAALMA  1.079826       8577           72\n",
      "4           NANDOS VANDE  0.865251       8577           72\n",
      "..                   ...       ...        ...          ...\n",
      "67           SPUR CUNCUN  0.150000       8577           72\n",
      "68        SPUR OAK CREEK  0.150000       8577           72\n",
      "69       STEERS MEYERTON  0.150000       8577           72\n",
      "70    WIMPY RIVER SQUARE  0.150000       8577           72\n",
      "71  WIMPY RIVERSIDE BOUL  0.150000       8577           72\n",
      "\n",
      "[72 rows x 4 columns]\n",
      "Delete graph fastfood_8577...\n",
      "[2160, 5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 2160, 8 of 24\n",
      "graph doesn't exist!\n",
      "        franchisename     score  community  membercount\n",
      "0      WIESENHOF COSM  2.862794       2160           84\n",
      "1        KFC TASBET P  1.892856       2160           84\n",
      "2        STEERS MIDDE  1.421844       2160           84\n",
      "3        KFC MIDDELBU  0.984272       2160           84\n",
      "4         KFC WITBANK  0.961804       2160           84\n",
      "..                ...       ...        ...          ...\n",
      "79  WIMPY G.C. GYPSEY  0.150000       2160           84\n",
      "80     WIMPY HAZYVIEW  0.150000       2160           84\n",
      "81     WIMPY KLIPFONT  0.150000       2160           84\n",
      "82        WIMPY KRIEL  0.150000       2160           84\n",
      "83     WIMPY MID MALL  0.150000       2160           84\n",
      "\n",
      "[84 rows x 4 columns]\n",
      "Delete graph fastfood_2160...\n",
      "[5959, 6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 5959, 9 of 24\n",
      "graph doesn't exist!\n",
      "       franchisename     score  community  membercount\n",
      "0       KFC NELSPRUI  3.990521       5959           96\n",
      "1     WIMPY BARBERTO  1.570571       5959           96\n",
      "2      NANDOS NELSPR  1.554117       5959           96\n",
      "3       WIESENHOF MA  1.534045       5959           96\n",
      "4     STEERS STIMELA  1.399891       5959           96\n",
      "..               ...       ...        ...          ...\n",
      "91  STEERS LYDENBURG  0.150000       5959           96\n",
      "92      STEERS NELSP  0.150000       5959           96\n",
      "93  STEERS NELSPRUIT  0.150000       5959           96\n",
      "94    WIMPY MALELANE  0.150000       5959           96\n",
      "95         WIMPY RSM  0.150000       5959           96\n",
      "\n",
      "[96 rows x 4 columns]\n",
      "Delete graph fastfood_5959...\n",
      "[6244, 7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6244, 10 of 24\n",
      "graph doesn't exist!\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "         franchisename     score  community  membercount\n",
      "0         STEERS PRELL  2.000298       6244          109\n",
      "1         KFC Thaba 'N  1.531328       6244          109\n",
      "2       MCD Bloemfonte  1.440592       6244          109\n",
      "3       WIMPY LOCHLOGA  1.216754       6244          109\n",
      "4       DEBONAIRS WELK  1.196247       6244          109\n",
      "..                 ...       ...        ...          ...\n",
      "104  STEERS CURIE PARK  0.150000       6244          109\n",
      "105     WIMPY ALIWAL N  0.150000       6244          109\n",
      "106       WIMPY TUBATS  0.150000       6244          109\n",
      "107     WIMPY VIRGINIA  0.150000       6244          109\n",
      "108         YUKON SPUR  0.150000       6244          109\n",
      "\n",
      "[109 rows x 4 columns]\n",
      "Delete graph fastfood_6244...\n",
      "[7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 7805, 11 of 24\n",
      "graph doesn't exist!\n"
     ]
    },
    {
     "ename": "TransientError",
     "evalue": "Database 'neo4j' unavailable",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTransientError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-31-100af241fe74>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     33\u001b[0m     \u001b[0mRETURN\u001b[0m \u001b[0mgds\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mutil\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0masNode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnodeId\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfranchisename\u001b[0m \u001b[0mAS\u001b[0m \u001b[0mfranchisename\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mscore\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     34\u001b[0m     ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n\u001b[0;32m---> 35\u001b[0;31m     \u001b[0mgf\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mpagerank_query\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mto_data_frame\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     36\u001b[0m     \u001b[0mgf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'community'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mcommunity\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     37\u001b[0m     \u001b[0mgf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'membercount'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtriadic_56101_community\u001b[0m\u001b[0;34m==\u001b[0m\u001b[0mcommunity\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'membercount'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mto_data_frame\u001b[0;34m(self, index, columns, dtype)\u001b[0m\n\u001b[1;32m   1287\u001b[0m             \u001b[0;32mraise\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1288\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1289\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mDataFrame\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmap\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mindex\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mindex\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcolumns\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mcolumns\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdtype\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mdtype\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1290\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1291\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mto_matrix\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmutable\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36m__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1069\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1070\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__iter__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1071\u001b[0;31m         \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mforward\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1072\u001b[0m             \u001b[0;32myield\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_current\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1073\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mforward\u001b[0;34m(self, amount)\u001b[0m\n\u001b[1;32m   1131\u001b[0m         \u001b[0mfetch\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_result\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1132\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0mmoved\u001b[0m \u001b[0;34m!=\u001b[0m \u001b[0mamount\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1133\u001b[0;31m             \u001b[0mnew_current\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1134\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mnew_current\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1135\u001b[0m                 \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/hydration/__init__.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    112\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_records\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_done\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    113\u001b[0m                 \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_on_more\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 114\u001b[0;31m                     \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_on_more\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    115\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    116\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mRecord\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mzip\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_records\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpopleft\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    417\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    418\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 419\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    420\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    459\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0msummary_signature\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34mb\"\\x7F\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    460\u001b[0m             \u001b[0mlog_debug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 461\u001b[0;31m             \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    462\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    463\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mProtocolError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Unexpected response message with signature %02X\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    749\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_failure\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    750\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 751\u001b[0;31m             \u001b[0mhandler\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    752\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_summary\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    753\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_fail\u001b[0;34m(cls, metadata)\u001b[0m\n\u001b[1;32m    279\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_fail\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    280\u001b[0m         \u001b[0;32mfrom\u001b[0m \u001b[0mpy2neo\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 281\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    282\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    283\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTransientError\u001b[0m: Database 'neo4j' unavailable"
     ]
    }
   ],
   "source": [
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "hf=pd.DataFrame()\n",
    "donelist=[]\n",
    "leftoverlist=triadic_56101_community_list.copy()\n",
    "counter=0\n",
    "for community in triadic_56101_community_list:\n",
    "    print('Doing community {community}, {counter} of {total}'.format(community=community,counter=len(donelist),total=len(triadic_56101_community_list)))\n",
    "    graphname=\"\"\"fastfood_{community}\"\"\".format(community=community)\n",
    "    query=\"\"\"CALL gds.graph.exists('{graphname}') YIELD exists;\"\"\".format(graphname=graphname)\n",
    "    exists=graph.run(query).data()\n",
    "    if exists[0]['exists']:\n",
    "        print(\"graph exists!\")\n",
    "        graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "    #     CALL gds.graph.drop('my-store-graph') YIELD graphName;\n",
    "    else:\n",
    "        print(\"graph doesn't exist!\")\n",
    "    # ----------------------------------------------------------------------------\n",
    "    create_graph_query=\"\"\"\n",
    "    CALL gds.graph.create.cypher(\n",
    "        'fastfood_{community}',\n",
    "        'MATCH (m:Merchant {{subclass_id:56101}}) WHERE EXISTS(m.triadic_56101_community) AND \n",
    "        m.triadic_56101_community = {community} RETURN ID(m) AS id',\n",
    "        'MATCH (a:Merchant)-[:TRIADIC_MERCHANT_FEET_LINK]->(b:Merchant) WHERE ID(a)<ID(b) AND\n",
    "        EXISTS(a.triadic_56101_community) AND EXISTS(b.triadic_56101_community) AND\n",
    "        a.triadic_56101_community = {community} AND\n",
    "        b.triadic_56101_community = {community}\n",
    "         RETURN ID(a) AS source, ID(b) AS target'\n",
    "    );\n",
    "    \"\"\".format(community=community)\n",
    "    graph.run(create_graph_query).data()\n",
    "\n",
    "    pagerank_query=\"\"\"CALL gds.pageRank.stream('{graphname}', {{ maxIterations: 20, dampingFactor: 0.85 }})\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).franchisename AS franchisename, score\n",
    "    ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n",
    "    gf=graph.run(pagerank_query).to_data_frame()\n",
    "    gf['community']=community\n",
    "    gf['membercount']=list(df[df.triadic_56101_community==community]['membercount'])[0]\n",
    "    gf.to_csv(path_or_buf='/media/lnr-ai/christo/github_repos/graphing/data/triadic_56101_community_df_{community}'.format(community=community),index=False) \n",
    "    hf = hf.append(gf, ignore_index=True)\n",
    "    print(gf)\n",
    "    print(\"Delete graph {graphname}...\".format(graphname=graphname))\n",
    "    graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "#     print('-Sleep 60s---------------------------------')\n",
    "#     time.sleep(60)\n",
    "    donelist.append(community)\n",
    "    leftoverlist.pop(leftoverlist.index(community))\n",
    "    print(leftoverlist)\n",
    "    counter+=1\n",
    "    print(\"====================================================================================\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[7805, 7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "leftoverlist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Doing community 7805, 0 of 13\n",
      "graph doesn't exist!\n",
      "          franchisename     score  community  membercount\n",
      "0          MCDONALD'S C  2.147556       7805          115\n",
      "1        SPUR EL SOMBRE  1.414796       7805          115\n",
      "2          KFC BAKERS M  1.104362       7805          115\n",
      "3          STEERS AUTOB  1.001734       7805          115\n",
      "4        KFC NORTHWAY (  0.977861       7805          115\n",
      "..                  ...       ...        ...          ...\n",
      "110      WIMPY ESTCOURT  0.150000       7805          115\n",
      "111      WIMPY GREYTOWN  0.150000       7805          115\n",
      "112        WIMPY HOWICK  0.150000       7805          115\n",
      "113  WIMPY LIBERTY MALL  0.150000       7805          115\n",
      "114      WIMPY WOODBURN  0.150000       7805          115\n",
      "\n",
      "[115 rows x 4 columns]\n",
      "Delete graph fastfood_7805...\n",
      "[7579, 1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 7579, 1 of 12\n",
      "graph doesn't exist!\n",
      "          franchisename     score  community  membercount\n",
      "0          KFC SUN VILL  2.287997       7579          122\n",
      "1          KFC RUSTENBU  1.736059       7579          122\n",
      "2          KFC TWIN CIT  1.276171       7579          122\n",
      "3        MCD Thabazimbi  1.222057       7579          122\n",
      "4          KFC MODDERSP  1.152089       7579          122\n",
      "..                  ...       ...        ...          ...\n",
      "117  WIMPY NABOOMSPRUIT  0.150000       7579          122\n",
      "118     WIMPY PECANWOOD  0.150000       7579          122\n",
      "119  WIMPY RUDAN MOTORS  0.150000       7579          122\n",
      "120      WIMPY THABA MA  0.150000       7579          122\n",
      "121      WIMPY VOORWAAR  0.150000       7579          122\n",
      "\n",
      "[122 rows x 4 columns]\n",
      "Delete graph fastfood_7579...\n",
      "[1875, 7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 1875, 2 of 11\n",
      "graph doesn't exist!\n",
      "          franchisename     score  community  membercount\n",
      "0          NANDOS MAKHA  2.506050       1875          128\n",
      "1          SPUR AMARILL  1.944246       1875          128\n",
      "2         Nandos Paledi  1.430212       1875          128\n",
      "3          KFC MASINGIT  1.411811       1875          128\n",
      "4          KFC LOUISTRI  1.409999       1875          128\n",
      "..                  ...       ...        ...          ...\n",
      "123  Nandos Paledi Mall  0.150000       1875          128\n",
      "124       OKLAHOMA SPUR  0.150000       1875          128\n",
      "125       SPUR AMARILLO  0.150000       1875          128\n",
      "126        WIMPY MUSINA  0.150000       1875          128\n",
      "127        WIMPY TZANEE  0.150000       1875          128\n",
      "\n",
      "[128 rows x 4 columns]\n",
      "Delete graph fastfood_1875...\n",
      "[7544, 5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 7544, 3 of 10\n",
      "graph doesn't exist!\n",
      "              franchisename     score  community  membercount\n",
      "0              NANDOS ESHOW  1.656570       7544          149\n",
      "1              McD Standert  1.589807       7544          149\n",
      "2              WIMPY EMPANG  1.454099       7544          149\n",
      "3              KFC STANDERT  1.392516       7544          149\n",
      "4              STEERS PONGO  1.374391       7544          149\n",
      "..                      ...       ...        ...          ...\n",
      "144         WIMPY EMPANGENI  0.150000       7544          149\n",
      "145           WIMPY N ERMEL  0.150000       7544          149\n",
      "146    WIMPY PIET RETIEF RE  0.150000       7544          149\n",
      "147          WIMPY VOLKSRUS  0.150000       7544          149\n",
      "148  WIMPY VRYHEID JUNCTION  0.150000       7544          149\n",
      "\n",
      "[149 rows x 4 columns]\n",
      "Delete graph fastfood_7544...\n",
      "[5898, 4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 5898, 4 of 9\n",
      "graph doesn't exist!\n",
      "              franchisename     score  community  membercount\n",
      "0              WIMPY METLIF  5.154408       5898          187\n",
      "1            McDONALDS LINT  4.840239       5898          187\n",
      "2              KFC KABEGA P  3.857038       5898          187\n",
      "3              KFC WALKER D  3.574236       5898          187\n",
      "4              KFC COMMERCI  1.954948       5898          187\n",
      "..                      ...       ...        ...          ...\n",
      "182            STEERS BATHU  0.150000       5898          187\n",
      "183  STEERS HUNTERS RETREAT  0.150000       5898          187\n",
      "184          TAMPA BAY SPUR  0.150000       5898          187\n",
      "185           WIMPY BAYWEST  0.150000       5898          187\n",
      "186          WIMPY SUNRIDGE  0.150000       5898          187\n",
      "\n",
      "[187 rows x 4 columns]\n",
      "Delete graph fastfood_5898...\n",
      "[4914, 154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 4914, 5 of 8\n",
      "graph doesn't exist!\n",
      "            franchisename     score  community  membercount\n",
      "0            KEI STEERS D  3.723035       4914          241\n",
      "1            KFC GREENFIE  2.924676       4914          241\n",
      "2           Nandos Circus  2.047389       4914          241\n",
      "3          DEBONAIRS BT N  1.890280       4914          241\n",
      "4          Nandos Vincent  1.636244       4914          241\n",
      "..                    ...       ...        ...          ...\n",
      "236       WIMPY ESPLANADE  0.150000       4914          241\n",
      "237  WIMPY GEORGE AIRPORT  0.150000       4914          241\n",
      "238      WIMPY OUDTDHOORN  0.150000       4914          241\n",
      "239     WIMPY YORK STREET  0.150000       4914          241\n",
      "240           WYKATO SPUR  0.150000       4914          241\n",
      "\n",
      "[241 rows x 4 columns]\n",
      "Delete graph fastfood_4914...\n",
      "[154, 6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 154, 6 of 7\n",
      "graph doesn't exist!\n",
      "              franchisename     score  community  membercount\n",
      "0            BURGER KING JE  4.866341        154          258\n",
      "1              KFC BLUE VAL  2.640957        154          258\n",
      "2            SIMPLY ASIA MA  2.608383        154          258\n",
      "3              KFC VORNA VA  2.340622        154          258\n",
      "4              KFC BLUE HIL  2.172427        154          258\n",
      "..                      ...       ...        ...          ...\n",
      "253  STEERS MIDSTREAM ESTAT  0.150000        154          258\n",
      "254     STEERS SANDTON CITY  0.150000        154          258\n",
      "255          WIESENHOF LINK  0.150000        154          258\n",
      "256        WIMPY CARLSWALD.  0.150000        154          258\n",
      "257    WIMPY MALL OF AFRICA  0.150000        154          258\n",
      "\n",
      "[258 rows x 4 columns]\n",
      "Delete graph fastfood_154...\n",
      "[6778, 5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 6778, 7 of 6\n",
      "graph doesn't exist!\n",
      "      franchisename     score  community  membercount\n",
      "0    MCD Sammy Mark  9.017964       6778          319\n",
      "1      STEERS WONDE  4.604200       6778          319\n",
      "2    Nandos Pretori  3.223853       6778          319\n",
      "3    NANDO S PRETOR  2.025940       6778          319\n",
      "4      Steers Elard  1.918901       6778          319\n",
      "..              ...       ...        ...          ...\n",
      "314      WIMPY EAST  0.150000       6778          319\n",
      "315    WIMPY HATFIE  0.150000       6778          319\n",
      "316  WIMPY MAYVILLE  0.150000       6778          319\n",
      "317      WIMPY WEST  0.150000       6778          319\n",
      "318  WIMPY WONDERPA  0.150000       6778          319\n",
      "\n",
      "[319 rows x 4 columns]\n",
      "Delete graph fastfood_6778...\n",
      "[5936, 6365, 8188, 1772, 5989]\n",
      "====================================================================================\n",
      "Doing community 5936, 8 of 5\n",
      "graph doesn't exist!\n"
     ]
    },
    {
     "ename": "TransientError",
     "evalue": "Database 'neo4j' unavailable",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTransientError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-33-f32143a80cbd>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     36\u001b[0m     \u001b[0mRETURN\u001b[0m \u001b[0mgds\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mutil\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0masNode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mnodeId\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfranchisename\u001b[0m \u001b[0mAS\u001b[0m \u001b[0mfranchisename\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mscore\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     37\u001b[0m     ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n\u001b[0;32m---> 38\u001b[0;31m     \u001b[0mgf\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mgraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mpagerank_query\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mto_data_frame\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     39\u001b[0m     \u001b[0mgf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'community'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mcommunity\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     40\u001b[0m     \u001b[0mgf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'membercount'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtriadic_56101_community\u001b[0m\u001b[0;34m==\u001b[0m\u001b[0mcommunity\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'membercount'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mto_data_frame\u001b[0;34m(self, index, columns, dtype)\u001b[0m\n\u001b[1;32m   1287\u001b[0m             \u001b[0;32mraise\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1288\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1289\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mDataFrame\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmap\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mindex\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mindex\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcolumns\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mcolumns\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdtype\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mdtype\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1290\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1291\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mto_matrix\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmutable\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mFalse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36m__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1069\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1070\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__iter__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1071\u001b[0;31m         \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mforward\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1072\u001b[0m             \u001b[0;32myield\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_current\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1073\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/database.py\u001b[0m in \u001b[0;36mforward\u001b[0;34m(self, amount)\u001b[0m\n\u001b[1;32m   1131\u001b[0m         \u001b[0mfetch\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_result\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1132\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0mmoved\u001b[0m \u001b[0;34m!=\u001b[0m \u001b[0mamount\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1133\u001b[0;31m             \u001b[0mnew_current\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1134\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mnew_current\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1135\u001b[0m                 \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/hydration/__init__.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    112\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_records\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_done\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    113\u001b[0m                 \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_on_more\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 114\u001b[0;31m                     \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_on_more\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    115\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    116\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mRecord\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mzip\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_records\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpopleft\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mfetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    417\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    418\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 419\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    420\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    421\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    459\u001b[0m         \u001b[0;32melif\u001b[0m \u001b[0msummary_signature\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34mb\"\\x7F\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    460\u001b[0m             \u001b[0mlog_debug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 461\u001b[0;31m             \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    462\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    463\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mProtocolError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Unexpected response message with signature %02X\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/neobolt/direct.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    749\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_failure\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    750\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 751\u001b[0;31m             \u001b[0mhandler\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    752\u001b[0m         \u001b[0mhandler\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandlers\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"on_summary\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    753\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/graphing/lib/python3.7/site-packages/py2neo/internal/connectors.py\u001b[0m in \u001b[0;36m_fail\u001b[0;34m(cls, metadata)\u001b[0m\n\u001b[1;32m    279\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_fail\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    280\u001b[0m         \u001b[0;32mfrom\u001b[0m \u001b[0mpy2neo\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 281\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mGraphError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    282\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    283\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mstatement\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtx\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mgraph\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTransientError\u001b[0m: Database 'neo4j' unavailable"
     ]
    }
   ],
   "source": [
    "# from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "hf=pd.DataFrame()\n",
    "donelist=[]\n",
    "tmp_list=leftoverlist.copy()\n",
    "# leftoverlist=tmp_list\n",
    "counter=0\n",
    "for community in leftoverlist:\n",
    "    print('Doing community {community}, {counter} of {total}'.format(community=community,counter=len(donelist),total=len(tmp_list)))\n",
    "    graphname=\"\"\"fastfood_{community}\"\"\".format(community=community)\n",
    "    query=\"\"\"CALL gds.graph.exists('{graphname}') YIELD exists;\"\"\".format(graphname=graphname)\n",
    "    exists=graph.run(query).data()\n",
    "    if exists[0]['exists']:\n",
    "        print(\"graph exists!\")\n",
    "        graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "    #     CALL gds.graph.drop('my-store-graph') YIELD graphName;\n",
    "    else:\n",
    "        print(\"graph doesn't exist!\")\n",
    "    # ----------------------------------------------------------------------------\n",
    "    create_graph_query=\"\"\"\n",
    "    CALL gds.graph.create.cypher(\n",
    "        'fastfood_{community}',\n",
    "        'MATCH (m:Merchant {{subclass_id:56101}}) WHERE EXISTS(m.triadic_56101_community) AND \n",
    "        m.triadic_56101_community = {community} RETURN ID(m) AS id',\n",
    "        'MATCH (a:Merchant)-[:TRIADIC_MERCHANT_FEET_LINK]->(b:Merchant) WHERE ID(a)<ID(b) AND\n",
    "        EXISTS(a.triadic_56101_community) AND EXISTS(b.triadic_56101_community) AND\n",
    "        a.triadic_56101_community = {community} AND\n",
    "        b.triadic_56101_community = {community}\n",
    "         RETURN ID(a) AS source, ID(b) AS target'\n",
    "    );\n",
    "    \"\"\".format(community=community)\n",
    "    graph.run(create_graph_query).data()\n",
    "\n",
    "    pagerank_query=\"\"\"CALL gds.pageRank.stream('{graphname}', {{ maxIterations: 20, dampingFactor: 0.85 }})\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).franchisename AS franchisename, score\n",
    "    ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n",
    "    gf=graph.run(pagerank_query).to_data_frame()\n",
    "    gf['community']=community\n",
    "    gf['membercount']=list(df[df.triadic_56101_community==community]['membercount'])[0]\n",
    "    gf.to_csv(path_or_buf='/media/lnr-ai/christo/github_repos/graphing/data/triadic_56101_community_df_{community}'.format(community=community),index=False) \n",
    "    hf = hf.append(gf, ignore_index=True)\n",
    "    print(gf)\n",
    "    print(\"Delete graph {graphname}...\".format(graphname=graphname))\n",
    "    graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "#     print('-Sleep 60s---------------------------------')\n",
    "#     time.sleep(60)\n",
    "    donelist.append(community)\n",
    "    tmp_list.pop(tmp_list.index(community))\n",
    "    print(tmp_list)\n",
    "    counter+=1\n",
    "    print(\"====================================================================================\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Doing community 5989, 0 of 1\n",
      "graph doesn't exist!\n",
      "            franchisename      score  community  membercount\n",
      "0           MCD Vangate (  14.216367       5989          765\n",
      "1           Nandos Grassy   3.626409       5989          765\n",
      "2            MCDONALD'S W   2.843273       5989          765\n",
      "3            KFC SANCTUAR   2.780964       5989          765\n",
      "4            KFC WATERFRO   2.684825       5989          765\n",
      "..                    ...        ...        ...          ...\n",
      "760  WIMPY BLUE ROUTE MAL   0.150000       5989          765\n",
      "761      WIMPY DEPARTURES   0.150000       5989          765\n",
      "762        WIMPY HERMANUS   0.150000       5989          765\n",
      "763  WIMPY TABLE BAY MALL   0.150000       5989          765\n",
      "764     WIMPY TYGERVALLEI   0.150000       5989          765\n",
      "\n",
      "[765 rows x 4 columns]\n",
      "Delete graph fastfood_5989...\n",
      "[]\n",
      "====================================================================================\n"
     ]
    }
   ],
   "source": [
    "# from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "hf=pd.DataFrame()\n",
    "donelist=[]\n",
    "leftoverlist=tmp_list.copy()\n",
    "# leftoverlist=tmp_list\n",
    "counter=0\n",
    "for community in leftoverlist:\n",
    "    print('Doing community {community}, {counter} of {total}'.format(community=community,counter=len(donelist),total=len(tmp_list)))\n",
    "    graphname=\"\"\"fastfood_{community}\"\"\".format(community=community)\n",
    "    query=\"\"\"CALL gds.graph.exists('{graphname}') YIELD exists;\"\"\".format(graphname=graphname)\n",
    "    exists=graph.run(query).data()\n",
    "    if exists[0]['exists']:\n",
    "        print(\"graph exists!\")\n",
    "        graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "    #     CALL gds.graph.drop('my-store-graph') YIELD graphName;\n",
    "    else:\n",
    "        print(\"graph doesn't exist!\")\n",
    "    # ----------------------------------------------------------------------------\n",
    "    create_graph_query=\"\"\"\n",
    "    CALL gds.graph.create.cypher(\n",
    "        'fastfood_{community}',\n",
    "        'MATCH (m:Merchant {{subclass_id:56101}}) WHERE EXISTS(m.triadic_56101_community) AND \n",
    "        m.triadic_56101_community = {community} RETURN ID(m) AS id',\n",
    "        'MATCH (a:Merchant)-[:TRIADIC_MERCHANT_FEET_LINK]->(b:Merchant) WHERE ID(a)<ID(b) AND\n",
    "        EXISTS(a.triadic_56101_community) AND EXISTS(b.triadic_56101_community) AND\n",
    "        a.triadic_56101_community = {community} AND\n",
    "        b.triadic_56101_community = {community}\n",
    "         RETURN ID(a) AS source, ID(b) AS target'\n",
    "    );\n",
    "    \"\"\".format(community=community)\n",
    "    graph.run(create_graph_query).data()\n",
    "\n",
    "    pagerank_query=\"\"\"CALL gds.pageRank.stream('{graphname}', {{ maxIterations: 20, dampingFactor: 0.85 }})\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).franchisename AS franchisename, score\n",
    "    ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n",
    "    gf=graph.run(pagerank_query).to_data_frame()\n",
    "    gf['community']=community\n",
    "    gf['membercount']=list(df[df.triadic_56101_community==community]['membercount'])[0]\n",
    "    gf.to_csv(path_or_buf='/media/lnr-ai/christo/github_repos/graphing/data/triadic_56101_community_df_{community}'.format(community=community),index=False) \n",
    "    hf = hf.append(gf, ignore_index=True)\n",
    "    print(gf)\n",
    "    print(\"Delete graph {graphname}...\".format(graphname=graphname))\n",
    "    graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "#     print('-Sleep 60s---------------------------------')\n",
    "#     time.sleep(60)\n",
    "    donelist.append(community)\n",
    "    tmp_list.pop(tmp_list.index(community))\n",
    "    print(tmp_list)\n",
    "    counter+=1\n",
    "    print(\"====================================================================================\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# graph.run(\"\"\"CALL gds.graph.exists('fastfood_{community}') YIELD exists;\"\"\".format(community=community)).data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"\"\"CALL gds.graph.exists('fastfood_{community}');\"\"\".format(community=community)).data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Doing community 5936\n",
      "graph doesn't exist!\n",
      "            franchisename     score  community  membercount\n",
      "0            WIMPY NEW RE  3.887059       5936          351\n",
      "1            KFC ELDORADO  2.729541       5936          351\n",
      "2            WIMPY THE GL  2.362756       5936          351\n",
      "3          MCD Protea Gle  2.208990       5936          351\n",
      "4            STEERS MAPON  2.059187       5936          351\n",
      "..                    ...       ...        ...          ...\n",
      "346  STEERS NEWTOWN JUNCT  0.150000       5936          351\n",
      "347        STEERS THE GLE  0.150000       5936          351\n",
      "348      STEERS/DEBONAIRS  0.150000       5936          351\n",
      "349          WICHITA SPUR  0.150000       5936          351\n",
      "350         WIMPY NEWTOWN  0.150000       5936          351\n",
      "\n",
      "[351 rows x 4 columns]\n",
      "Delete graph fastfood_5936...\n",
      "====================================================================================\n"
     ]
    }
   ],
   "source": [
    "community=5936\n",
    "print('Doing community {community}'.format(community=community))\n",
    "graphname=\"\"\"fastfood_{community}\"\"\".format(community=community)\n",
    "query=\"\"\"CALL gds.graph.exists('{graphname}') YIELD exists;\"\"\".format(graphname=graphname)\n",
    "exists=graph.run(query).data()\n",
    "if exists[0]['exists']:\n",
    "    print(\"graph exists!\")\n",
    "    graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "#     CALL gds.graph.drop('my-store-graph') YIELD graphName;\n",
    "else:\n",
    "    print(\"graph doesn't exist!\")\n",
    "# ----------------------------------------------------------------------------\n",
    "create_graph_query=\"\"\"\n",
    "CALL gds.graph.create.cypher(\n",
    "    'fastfood_{community}',\n",
    "    'MATCH (m:Merchant {{subclass_id:56101}}) WHERE EXISTS(m.triadic_56101_community) AND \n",
    "    m.triadic_56101_community = {community} RETURN ID(m) AS id',\n",
    "    'MATCH (a:Merchant)-[:TRIADIC_MERCHANT_FEET_LINK]->(b:Merchant) WHERE ID(a)<ID(b) AND\n",
    "    EXISTS(a.triadic_56101_community) AND EXISTS(b.triadic_56101_community) AND\n",
    "    a.triadic_56101_community = {community} AND\n",
    "    b.triadic_56101_community = {community}\n",
    "     RETURN ID(a) AS source, ID(b) AS target'\n",
    ");\n",
    "\"\"\".format(community=community)\n",
    "graph.run(create_graph_query).data()\n",
    "\n",
    "pagerank_query=\"\"\"CALL gds.pageRank.stream('{graphname}', {{ maxIterations: 20, dampingFactor: 0.85 }})\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).franchisename AS franchisename, score\n",
    "ORDER BY score DESC, franchisename ASC;\"\"\".format(graphname=graphname)\n",
    "gf=graph.run(pagerank_query).to_data_frame()\n",
    "gf['community']=community\n",
    "gf['membercount']=list(df[df.triadic_56101_community==community]['membercount'])[0]\n",
    "hf = hf.append(gf, ignore_index=True)\n",
    "print(gf)\n",
    "print(\"Delete graph {graphname}...\".format(graphname=graphname))\n",
    "graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "\n",
    "print(\"====================================================================================\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[7916,\n",
       " 2697,\n",
       " 6246,\n",
       " 6305,\n",
       " 6314,\n",
       " 290,\n",
       " 6790,\n",
       " 8577,\n",
       " 2160,\n",
       " 5959,\n",
       " 6244,\n",
       " 7805,\n",
       " 7579,\n",
       " 1875,\n",
       " 7544,\n",
       " 5898,\n",
       " 4914,\n",
       " 154,\n",
       " 6778,\n",
       " 5936,\n",
       " 6365,\n",
       " 8188,\n",
       " 1772,\n",
       " 5989]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "triadic_56101_community_list"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Delete community client link edges"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Choose community:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "community=2697"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'batches': 3, 'total': 1500}]"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "delete_query=\"\"\"CALL apoc.periodic.iterate('MATCH (client0:Client)-[cl:CLIENT_LINK_{community}]-(client1:Client)\n",
    "WHERE ID(client1)<ID(client0)\n",
    "RETURN cl;'\n",
    ", 'DELETE cl', {{batchSize:500, iterateList:true, parallel:true}})\n",
    "yield batches, total return batches, total;\"\"\".format(community=community)\n",
    "graph.run(delete_query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "count_links_query=\"\"\"MATCH (client0:Client)-[cl:CLIENT_LINK_{community}]-(client1:Client)\n",
    "WHERE ID(client1)<ID(client0)\n",
    "RETURN count(cl) as client_links;\"\"\".format(community=community)\n",
    "# graph.run(count_links_query).data()\n",
    "df=graph.run(count_links_query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>client_links</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>23747</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   client_links\n",
       "0         23747"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'batches': 747, 'total': 373261}]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# community=2697\n",
    "graph = Graph(\"bolt://localhost:7687\", user='neo4j', password='newPassword')\n",
    "client_link_query=\"\"\"CALL apoc.periodic.iterate('MATCH (client0:Client)-[t0:TRANSACTED_AT]->(merchant:Merchant)<-[t1:TRANSACTED_AT]-(client1:Client)\n",
    "WHERE ID(client0) < ID(client1) AND \n",
    "merchant.triadic_56101_community = {community} \n",
    "RETURN client0, client1, t0, t1;\n",
    "', \"MERGE (client0)-[link:CLIENT_LINK_{community}]-(client1)\n",
    "ON CREATE SET link.count = 1,\n",
    "link.ID0=ID(client0),\n",
    "link.ID1=ID(client1),\n",
    "link.transactioncount0 = t0.transactioncount,\n",
    "link.transactioncount1 = t1.transactioncount,\n",
    "link.transactionamount0 = t0.transactionamount,\n",
    "link.transactionamount1 = t1.transactionamount\n",
    "ON MATCH SET link.count = link.count + 1,\n",
    "link.transactioncount0 = link.transactioncount0+t0.transactioncount,\n",
    "link.transactioncount1 = link.transactioncount1+t1.transactioncount,\n",
    "link.transactionamount0 = link.transactionamount0+t0.transactionamount,\n",
    "link.transactionamount1 = link.transactionamount1+t1.transactionamount;\", {{batchSize:500, iterateList:true, parallel:true}})\n",
    "yield batches, total return batches, total;\n",
    "\"\"\".format(community=community)\n",
    "graph.run(client_link_query).data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Check sub graph existence and delete"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Doing community 2697\n",
      "graph doesn't exist!\n"
     ]
    }
   ],
   "source": [
    "print('Doing community {community}'.format(community=community))\n",
    "graphname=\"\"\"client_link_graph_{community}\"\"\".format(community=community)\n",
    "query=\"\"\"CALL gds.graph.exists('{graphname}') YIELD exists;\"\"\".format(graphname=graphname)\n",
    "exists=graph.run(query).data()\n",
    "if exists[0]['exists']:\n",
    "    print(\"graph exists!\")\n",
    "    graph.run(\"\"\"CALL gds.graph.drop('{graphname}') YIELD graphName;\"\"\".format(graphname=graphname)).data()\n",
    "#     CALL gds.graph.drop('my-store-graph') YIELD graphName;\n",
    "else:\n",
    "    print(\"graph doesn't exist!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create a subgraph for clients related via a client_link relationship between clients for ONE merchant cluster/community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'graphName': 'client_link_graph_2697',\n",
       "  'nodeCount': 3398,\n",
       "  'relationshipCount': 47494,\n",
       "  'createMillis': 3124}]"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subgraph_query=\"\"\"CALL gds.graph.create.cypher(\n",
    "    '{graphname}',\n",
    "    'MATCH (c0:Client)-[:TRANSACTED_AT]->(m:Merchant) WHERE EXISTS(m.triadic_56101_community) AND \n",
    "    m.triadic_56101_community = {community} RETURN id(c0) AS id',\n",
    "    'MATCH (c0:Client)-[rel:CLIENT_LINK_{community}]-(c1:Client) RETURN id(c0) AS source, id(c1) AS target, rel.count as count'\n",
    ")\n",
    "YIELD graphName, nodeCount, relationshipCount, createMillis;\"\"\".format(graphname=graphname,community=community)\n",
    "graph.run(subgraph_query).data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cluster this subgraph of clients and STREAM output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "louvain_stream_query=\"\"\"CALL gds.louvain.stream('client_link_graph_{community}', {{ relationshipWeightProperty: 'count', \n",
    "maxLevels:10, \n",
    "maxIterations:200, includeIntermediateCommunities:true}})\n",
    "YIELD nodeId, communityId, intermediateCommunityIds\n",
    "RETURN gds.util.asNode(nodeId).dedupestatic AS dedupestatic, communityId, intermediateCommunityIds\n",
    "ORDER BY communityId DESC;\"\"\".format(community=community)\n",
    "# graph.run(louvain_stream_query).data()\n",
    "df=graph.run(louvain_stream_query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cluster this  subgraph of clients and WRITE output on each client node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "louvain_write_query=\"\"\"CALL gds.louvain.write('client_link_graph_{community}', {{ relationshipWeightProperty: 'count', \n",
    "maxLevels:10, \n",
    "maxIterations:200, writeProperty: 'client_link_community_{community}' }})\n",
    "YIELD communityCount, modularity, modularities\"\"\".format(community=community)\n",
    "graph.run(louvain_write_query).data()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Inspect client membership of merhcant community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "client_membership_query=\"\"\"MATCH (c:Client) \n",
    "WHERE EXISTS(c.client_link_community_{community}) \n",
    "RETURN COUNT(c.client_link_community_{community}) as count, c.client_link_community_{community} as \n",
    "client_link_community\n",
    "ORDER BY count ASC\"\"\".format(community=community)\n",
    "# graph.run(louvain_stream_query).data()\n",
    "df=graph.run(client_membership_query).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
